STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>ADF_DFLT0CR</name>
          <displayName>ADF_DFLT0CR</displayName>
          <description>ADF digital filter control register 0</description>
          <addressOffset>0x088</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFLTEN</name>
              <description>DFLT0 enable
This bit is set and cleared by software. It is used to control the start of acquisition of the DFLT0 path. This bit behavior depends on ACQMOD[2:0] and external events. The serial or parallel interface delivering the samples must be enabled as well.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Acquisition immediately stopped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Acquisition immediately started if ACQMOD[2:0] = 00x or 101, or acquisition started when the proper trigger event occurs if ACQMOD[2:0] = 01x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA requests enable
This bit is set and cleared by software. It is used to control the generation of DMA request to transfer the processed samples into the memory.
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DMA interface for the corresponding digital filter disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DMA interface for the corresponding digital filter enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTH</name>
              <description>RXFIFO threshold selection
This bit is set and cleared by software. It is used to select the RXFIFO threshold. 
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RXFIFO threshold event generated when the RXFIFO is not empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RXFIFO threshold event generated when the RXFIFO is half-full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACQMOD</name>
              <description>DFLT0 trigger mode
This bit field is set and cleared by software. It is used to select the filter trigger mode.
Others: Same as 000
Note: This bit field can be write-protected (see Section40.4.13 for details)..</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Asynchronous continuous acquisition mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Asynchronous single-shot acquisition mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Synchronous continuous acquisition mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Synchronous single-shot acquisition mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>Window continuous acquisition mode</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSENS</name>
              <description>DFLT0 trigger sensitivity selection
This bit field is set and cleared by software. It is used to select the trigger sensitivity of the external signals
When the trigger source is TRGO, TRGSENS value is not taken into account. When TRGO is selected, the sensitivity is forced to falling edge.
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>A rising edge event triggers the acquisition.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>A falling edge even triggers the acquisition.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>DFLT0 trigger signal selection
This bit field is set and cleared by software. It is used to select which external signals trigger DFLT0.
Others: Reserved
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>TRGO selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>adf_trgi selected</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBDIS</name>
              <description>Number of samples to be discarded
This bit field is set and cleared by software. It is used to define the number of samples to be discarded every time DFLT0 is re-started.
...
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No sample discarded</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>1 sample discarded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFLTRUN</name>
              <description>DFLT0 run status flag
This bit is set and cleared by hardware. It indicates if DFLT0 is running or not.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DFLT0 not running and ready to accept a new trigger event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DFLT0running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFLTACTIVE</name>
              <description>DFLT0 active flag
This bit is set and cleared by hardware. It indicates if DFLT0 is active: can be running or waiting for events.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DFLT0 not active (can be re-enabled again, via DFLTEN bit, if needed)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DFLT0 active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0CICR</name>
          <displayName>ADF_DFLT0CICR</displayName>
          <description>ADF digital filer configuration register 0</description>
          <addressOffset>0x08C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATSRC</name>
              <description>Source data for the digital filter
This bit field is set and cleared by software.
0x: Stream coming from the BSMX selected
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Stream coming from the ADCITF1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Stream coming from the ADCITF2 selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CICMOD</name>
              <description>Select the CIC order
This bit field is set and cleared by software. It is used to select the order of the MCIC.
Others: Reserved
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>MCIC configured in single Sincsup4/sup filter</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>MCIC configured in single Sincsup5/sup filter</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCICD</name>
              <description>CIC decimation ratio selection
This bit field is set and cleared by software.It is used to select the CIC decimation ratio. Adecimation ratio smaller than two is not allowed. The decimation ratio is given by (CICDEC+1).
...
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Decimation ratio is 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Decimation ratio is 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCICD8</name>
              <description>CIC decimation ratio selection
This bit field is set and cleared by software.It is used to select the CIC decimation ratio. Adecimation ratio smaller than two is not allowed. The decimation ratio is given by (CICDEC+1).
...
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Decimation ratio is 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Decimation ratio is 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor selection
This bit field is set and cleared by software. It is used to select the gain to be applied at CIC output (see Table389 for details). If the application attempts to write a new gain value while the previous one is not yet applied, this new gain value is ignored. Reading back this bit field informs the application on the current gain value.
...
...
Others: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>0 dB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>+ 3.5 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>+ 6 dB or shift left by 1 bit</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x18</name>
                  <description>+ 72 dB or shift left by 12 bits</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x20</name>
                  <description>- 48.2 dB or shift right by 8 bits (default value)</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x21</name>
                  <description>- 44.6 dB</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x22</name>
                  <description>- 42.1 dB or shift right by 7 bits</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x23</name>
                  <description>- 38.6 dB</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2E</name>
                  <description>-6 dB or shift right by 1 bit</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2F</name>
                  <description>-2.5 dB</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0RSFR</name>
          <displayName>ADF_DFLT0RSFR</displayName>
          <description>ADF reshape filter configuration register 0</description>
          <addressOffset>0x090</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSFLTBYP</name>
              <description>Reshaper filter bypass
This bit is set and cleared by software. It is used to bypass the reshape filter and its decimation block.
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Reshape filter not bypassed (default value)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Reshape filter bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSFLTD</name>
              <description>Reshaper filter decimation ratio
This bit is set and cleared by software. It is used to select the decimation ratio for the reshape filter
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Decimation ratio is 4 (default value).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Decimation ratio is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPFBYP</name>
              <description>High-pass filter bypass
This bit is set and cleared by software. It is used to bypass the high-pass filter.
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>HPF not bypassed (default value)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HPF bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPFC</name>
              <description>High-pass filter cut-off frequency
This bit field is set and cleared by software. it is used to select the cut-off frequency of the high-pass filter. FsubPCM/sub represents the sampling frequency at HPF input.
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Cut-off frequency = 0.000625 x FPCM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Cut-off frequency = 0.00125 x FPCM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Cut-off frequency = 0.00250 x FPCM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Cut-off frequency = 0.00950 x FPCM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
