STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>ADF_SADCR</name>
          <displayName>ADF_SADCR</displayName>
          <description>ADF SAD control register</description>
          <addressOffset>0x0B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADEN</name>
              <description>Sound activity detector enable
This bit is set and cleared by software. It is used to enable/disable the SAD.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SAD disabled and SAD state reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SAD enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATCAP</name>
              <description>Data capture mode
This bit field is set and cleared by software. It is used to define in which conditions, the samples provided by DLFT0 are stored into the memory.
1x: Samples from DFLT0 transfered into memory when SAD and DFLT0 are enabled
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Samples from DFLT0 not transfered into the memory</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Samples from DFLT0 transfered into the memory when SAD is in DETECT state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETCFG</name>
              <description>Sound trigger event configuration
This bit is set and cleared by software. It is used to define if the sddet_evt event is generated only when the SAD enters to MONITOR state or when the SAD enters or exits the DETECT state. 
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sddet_evt generated when SAD enters the MONITOR state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sddet_evt generated when SAD enters or exits the DETECT state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SADST</name>
              <description>SAD state
This bit field is set and cleared by hardware. It indicates the SAD state and is meaningful only when SADEN = 1. The SAD state can be:
- LEARN when the SAD is in learning phase or in SDLVL computation mode
- MONITOR when the SAD is in monitoring phase
- DETECT when the SAD detects a sound</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SAD in LEARN state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SAD in MONITOR state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>SAD in DETECT state</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTEN</name>
              <description>Hysteresis enable
This bit is set and cleared by software. It is used to enable/disable the hysteresis function (see Table389 for details). This bit must be kept to 0 when SADMOD[1:0] = 1x.
Note: This bit can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Hysteresis function disabled. THRsubH/sub is always used.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Hysteresis function enabled. THRsubH/sub is used for MONITOR to DETECT transition and THRsubL/sub is used for DETECT to MONITOR transition.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRSIZE</name>
              <description>Frame size
This bit field is set and cleared by software. it is used to define the size of one frame and also to define how many samples are taken into account to compute the short-term signal level.
11x: 512 PCM samples used to compute the short-term signal level
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>8 PCM samples used to compute the short-term signal level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>16 PCM samples used to compute the short-term signal level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>32 PCM samples used to compute the short-term signal level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>64 PCM samples used to compute the short-term signal level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>128 PCM samples used to compute the short-term signal level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>256 PCM samples used to compute the short-term signal level</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SADMOD</name>
              <description>SAD working mode
This bit field is set and cleared by software. It is used to define the way the SAD works.
The SAD triggers when the sound level (SDLVL) is bigger than the defined threshold. In this mode, the SAD works like a voice activity detector.
The SAD triggers when the sound level (SDLVL) is bigger than the defined threshold. In this mode, the SAD works like a sound detector.
1x: Threshold value given by 4 x ANMIN[12:0]
The SAD triggers when the estimated ambient noise (ANLVL), multiplied by the gain selected by SNTHR[3:0] is bigger than the defined threshold. In this mode, the SAD is working like an ambient noise estimator. Hysteresis function cannot be used in this mode.
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Threshold value computed according to the estimated ambient noise</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Threshold value equal to ANMIN[12:0], multiplied by the gain selected by SNTHR[3:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SADACTIVE</name>
              <description>SAD Active flag
This bit is set and cleared by hardware. It is used to check if the SAD is effectively enabled (active) or not. The protected fields and registers of this function can only be updated when the SADACTIVE is set to 0 (see Section40.4.13 for details). 
The delay between a transition on SADEN and a transition on SADACTIVE is two periods of AHB clock and two periods of adf_proc_ck.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SAD not active and can be configured if needed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SAD active and protected fields cannot be configured.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADCFGR</name>
          <displayName>ADF_SADCFGR</displayName>
          <description>ADF SAD configuration register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SNTHR</name>
              <description>Signal to noise threshold
This bit field is set and cleared by software. It is used to define THRsubH /sub(and THRsubL/sub if hysteresis is enabled). See Table389 for details.
others: Reserved
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>THRsubH /subis 3.5 dB higher than ANLVL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>THRsubH /subis 6.0 dB higher than ANLVL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>THRsubH /subis 9.5 dB higher than ANLVL</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>THRsubH /subis 12 dB higher than ANLVL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>THRsubH /subis 15.6 dB higher than ANLVL</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>THRsubH /subis 18 dB higher than ANLVL</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>THRsubH /subis 21.6 dB higher than ANLVL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>THRsubH /subis 24.1 dB higher than ANLVL</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>THRsubH /subis 27.6 dB higher than ANLVL</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>THRsubH /subis 30.1dB higher than ANLVL</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANSLP</name>
              <description>Ambient noise slope control
This bit field is set and cleared by software. It is used to define the positive and negative slope of the noise estimator, in charge of updating the ANLVL (see Ambient noise estimation (ANLVL) for information about programming this bit field).
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFRNB</name>
              <description>Number of learning frames
This bit field is set and cleared by software. It is used to define the number of learning frames to perform the first estimate of the noise level.
1xx: 32 frames used to compute the initial noise level
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>2 frames used to compute the initial noise level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>4 frames used to compute the initial noise level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>8 frames used to compute the initial noise level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>16 frames used to compute the initial noise level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HGOVR</name>
              <description>Hangover time window
This bit field is set and cleared by software. Once the SAD state is DETECT, this parameter is used to define the amount of time the sound is allowed to remain below the threshold, before switching the SAD to MONITOR state (see FRSIZE bit field for the description of a frame).
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 4 frames</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 8 frames</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 16 frames</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 32 frames</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 64 frames</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 128 frames</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 256 frames</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>SAD back to MONITOR state if sound is below threshold for 512 frames</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANMIN</name>
              <description>Minimum noise level
This bit field is set and cleared by software. It is used to define the minimum noise level and then the sensitivity. It represents a positive number. 
Note: This bit field can be write-protected (see Section40.4.13 for details).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADSDLVR</name>
          <displayName>ADF_SADSDLVR</displayName>
          <description>ADF SAD sound level register</description>
          <addressOffset>0x0C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDLVL</name>
              <description>Short term sound level
This bit field is set by hardware. It contains the latest sound level computed by the SAD. To refresh this value, SDLVLF must be cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_SADANLVR</name>
          <displayName>ADF_SADANLVR</displayName>
          <description>ADF SAD ambient noise level register</description>
          <addressOffset>0x0C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANLVL</name>
              <description>Ambient noise level estimation
This bit field is set by hardware. It contains the latest ambient noise level computed by the SAD. To refresh this bit field, the SDLVLF flag must be cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADF_DFLT0DR</name>
          <displayName>ADF_DFLT0DR</displayName>
          <description>ADF digital filter data register 0</description>
          <addressOffset>0x0F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by DFT0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
