STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_RPR1</name>
          <displayName>EXTI2_RPR1</displayName>
          <description>EXTI2 rising edge pending register </description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPIF0</name>
              <description>configurable event input 0 rising edge Pending bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF1</name>
              <description>configurable event input 1 rising edge Pending bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF2</name>
              <description>configurable event input 2 rising edge Pending bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF3</name>
              <description>configurable event input 3 rising edge Pending bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF4</name>
              <description>configurable event input 4 rising edge Pending bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF5</name>
              <description>configurable event input 5 rising edge Pending bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF6</name>
              <description>configurable event input 6 rising edge Pending bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF7</name>
              <description>configurable event input 7 rising edge Pending bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF8</name>
              <description>configurable event input 8 rising edge Pending bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF9</name>
              <description>configurable event input 9 rising edge Pending bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF10</name>
              <description>configurable event input 10 rising edge Pending bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF11</name>
              <description>configurable event input 11 rising edge Pending bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF12</name>
              <description>configurable event input 12 rising edge Pending bit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF13</name>
              <description>configurable event input 13 rising edge Pending bit.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF14</name>
              <description>configurable event input 14 rising edge Pending bit.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF15</name>
              <description>configurable event input 15 rising edge Pending bit.
When EXTI2_SECCFGR1.SEC15 is disabled, RPIF15 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC15 is enabled, RPIF15 can only be accessed with secure access. Non-secure write to this RPIF15 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV15 is disabled, RPIF15 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR1.PRIV15 is enabled, RPIF15 can only be accessed with privilege access. Unprivileged write to this RPIF15 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E15CIDCFGR this RPIF15 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E15CIDCFGR this RPIF15 can only be accessed by the allowed processor CID. Dis allowed CID write to this RPIF15 is discarded and read returns 0.
This bit is set when the selected rising edge event or an EXTI2_SWIER Software trigger arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>selected rising edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_FPR1</name>
          <displayName>EXTI2_FPR1</displayName>
          <description>EXTI2 falling edge pending register </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPIF0</name>
              <description>configurable event input 0 falling edge pending bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF1</name>
              <description>configurable event input 1 falling edge pending bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF2</name>
              <description>configurable event input 2 falling edge pending bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF3</name>
              <description>configurable event input 3 falling edge pending bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF4</name>
              <description>configurable event input 4 falling edge pending bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF5</name>
              <description>configurable event input 5 falling edge pending bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF6</name>
              <description>configurable event input 6 falling edge pending bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF7</name>
              <description>configurable event input 7 falling edge pending bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF8</name>
              <description>configurable event input 8 falling edge pending bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF9</name>
              <description>configurable event input 9 falling edge pending bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF10</name>
              <description>configurable event input 10 falling edge pending bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF11</name>
              <description>configurable event input 11 falling edge pending bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF12</name>
              <description>configurable event input 12 falling edge pending bit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF13</name>
              <description>configurable event input 13 falling edge pending bit.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF14</name>
              <description>configurable event input 14 falling edge pending bit.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF15</name>
              <description>configurable event input 15 falling edge pending bit.
When EXTI2_SECCFGR1.SEC15 is disabled, FPIF15 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC15 is enabled, FPIF15 can only be accessed with secure access. Non-secure write to this FPIF15 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV15 is disabled, FPIF15 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR1.PRIV15 is enabled, FPIF15 can only be accessed with privilege access. Unprivileged write to this FPIF15 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E15CIDCFGR this FPIF15 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E15CIDCFGR this FPIF15 can only be accessed by the allowed processor CID. Dis allowed CID write to this FPIF15 is discarded and read returns 0.
This bit is set when the falling edge event arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No falling edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>falling edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_SECCFGR1</name>
          <displayName>EXTI2_SECCFGR1</displayName>
          <description>EXTI2 security configuration register </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC1</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC2</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC3</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC4</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC5</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC6</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC7</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC8</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC9</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC10</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC11</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC12</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC13</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC14</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC15</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC16</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC17</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC18</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC19</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC20</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC21</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC22</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC23</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC24</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC25</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC26</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC27</name>
              <description>Security enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC29</name>
              <description>Security enable on event input 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC30</name>
              <description>Security enable on event input 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC31</name>
              <description>Security enable on event input 31.
When CID filtering is disabled in EXTI2_E31CIDCFGR this SEC31 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E31CIDCFGR this SEC31 can only be accessed by the allowed processor CID. Dis allowed CID write to this SEC31 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (non-secure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
