STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_PRIVCFGR1</name>
          <displayName>EXTI2_PRIVCFGR1</displayName>
          <description>EXTI2 Privilege configuration register </description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV19</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV20</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Privilege enable on event input n. (where n = 27 to 0)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Privilege enable on event input 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Privilege enable on event input 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Privilege enable on event input 31.
When EXTI2_SECCFGR1.SEC31 is disabled, PRIV31 can be accessed with secure and non-secure access.
When EXTI2_SECCFGR1.SEC31 is enabled, PRIV31 can only be written with secure access. Non-secure write to this PRIV31 is discarded.
When CID filtering is disabled in EXTI2_E31CIDCFGR this PRIV31 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E31CIDCFGR this PRIV31 can only be accessed by the allowed processor CID. Dis allowed CID write to this PRIV31 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event privilege disabled (Unprivileged)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event privilege enabled (Privileged)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_RTSR2</name>
          <displayName>EXTI2_RTSR2</displayName>
          <description>EXTI2 rising trigger selection register </description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT46</name>
              <description>Rising trigger event configuration bit of configurable event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT47</name>
              <description>Rising trigger event configuration bit of configurable event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT48</name>
              <description>Rising trigger event configuration bit of configurable event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT49</name>
              <description>Rising trigger event configuration bit of configurable event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT50</name>
              <description>Rising trigger event configuration bit of configurable event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT51</name>
              <description>Rising trigger event configuration bit of configurable event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT59</name>
              <description>Rising trigger event configuration bit of configurable event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT60</name>
              <description>Rising trigger event configuration bit of configurable event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT61</name>
              <description>Rising trigger event configuration bit of configurable event input 61.
When EXTI2_SECCFGR2.SEC61 is disabled, RT61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, RT61 can only be accessed with secure access. Non-secure write to this RT61 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, RT61 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, RT61 can only be accessed with privilege access. Unprivileged write to this RT61 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this RT61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this RT61 can only be accessed by the allowed processor CID. Dis allowed CID write to this RT61 is discarded and read returns 0.
Note: The configurable event input is edge triggered. No glitch must be generated on this input. If a rising edge on the configurable event input occurs while writing to the register, the associated pending bit is not set.
Rising and falling edge triggers can be set for the same configurable event input. In this case, both edges generate a trigger.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_FTSR2</name>
          <displayName>EXTI2_FTSR2</displayName>
          <description>EXTI2 falling trigger selection register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FT46</name>
              <description>Falling trigger event configuration bit of configurable event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT47</name>
              <description>Falling trigger event configuration bit of configurable event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT48</name>
              <description>Falling trigger event configuration bit of configurable event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT49</name>
              <description>Falling trigger event configuration bit of configurable event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT50</name>
              <description>Falling trigger event configuration bit of configurable event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT51</name>
              <description>Falling trigger event configuration bit of configurable event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT59</name>
              <description>Falling trigger event configuration bit of configurable event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT60</name>
              <description>Falling trigger event configuration bit of configurable event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT61</name>
              <description>Falling trigger event configuration bit of configurable event input 61.
When EXTI2_SECCFGR2.SEC61 is disabled, FT61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, FT61 can only be accessed with secure access. Non-secure write to this FT61 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, FT61 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, FT61 can only be accessed with privilege access. Unprivileged write to this FT61 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this FT61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this FT61 can only be accessed by the allowed processor CID. Dis allowed CID write to this FT61 is discarded and read returns 0.
Note: The configurable event input is edge triggered. No glitch must be generated on this input. If a falling edge on the configurable event input occurs while writing to the register, the associated pending bit is not set.
Rising and falling edge triggers can be set for the same configurable event input. In this case, both edges generate a trigger.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
