STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_SWIER2</name>
          <displayName>EXTI2_SWIER2</displayName>
          <description>EXTI2 software interrupt event register </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWI46</name>
              <description>Software interrupt on event 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI47</name>
              <description>Software interrupt on event 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI48</name>
              <description>Software interrupt on event 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI49</name>
              <description>Software interrupt on event 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI50</name>
              <description>Software interrupt on event 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI51</name>
              <description>Software interrupt on event 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI59</name>
              <description>Software interrupt on event 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI60</name>
              <description>Software interrupt on event 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI61</name>
              <description>Software interrupt on event 61.
When EXTI2_SECCFGR2.SEC61 is disabled, SWI61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, SWI61 can only be accessed with secure access. Non-secure write to this SWI61 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, SWI61 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, SWI61 can only be accessed with privilege access. Unprivileged write to this SWI61 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this SWI61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this SWI61 can only be accessed by the allowed processor CID. Dis allowed CID write to this SWI61 is discarded and read returns 0.
A software interrupt is generated independent from the setting in EXTI2_RTSR and EXTI2_FTSR. It always returns 0 when read.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 0 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing a 1 to this bit triggers a rising edge event on event 61. This bit is auto cleared by HW.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_RPR2</name>
          <displayName>EXTI2_RPR2</displayName>
          <description>EXTI2 rising edge pending register </description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPIF46</name>
              <description>configurable event input 46 rising edge Pending bit.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF47</name>
              <description>configurable event input 47 rising edge Pending bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF48</name>
              <description>configurable event input 48 rising edge Pending bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF49</name>
              <description>configurable event input 49 rising edge Pending bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF50</name>
              <description>configurable event input 50 rising edge Pending bit.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF51</name>
              <description>configurable event input 51 rising edge Pending bit.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF59</name>
              <description>configurable event input 59 rising edge Pending bit.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF60</name>
              <description>configurable event input 60 rising edge Pending bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF61</name>
              <description>configurable event input 61 rising edge Pending bit.
When EXTI2_SECCFGR2.SEC61 is disabled, RPIF61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, RPIF61 can only be accessed with secure access. Non-secure write to this RPIF61 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, RPIF ca61 be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, RPIF61 can only be accessed with privilege access. Unprivileged write to this RPIF61 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this RPIF61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this RPIF61 can only be accessed by the allowed processor CID. Dis allowed CID write to this RPIF61 is discarded and read returns 0.
This bit is set when the selected rising edge event or an EXTI2_SWIER Software trigger arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>selected rising edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_FPR2</name>
          <displayName>EXTI2_FPR2</displayName>
          <description>EXTI2 falling edge pending register </description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPIF46</name>
              <description>configurable event input 46 pending bit.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF47</name>
              <description>configurable event input 47 pending bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF48</name>
              <description>configurable event input 48 pending bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF49</name>
              <description>configurable event input 49 pending bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF50</name>
              <description>configurable event input 50 pending bit.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF51</name>
              <description>configurable event input 51 pending bit.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF59</name>
              <description>configurable event input 59 pending bit.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF60</name>
              <description>configurable event input 60 pending bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF61</name>
              <description>configurable event input 61 pending bit.
When EXTI2_SECCFGR2.SEC61 is disabled, FPIF61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, FPIF61 can only be accessed with secure access. Non-secure write to this FPIF61 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, FPIF61 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, FPIF61 can only be accessed with privilege access. Unprivileged write to this FPIF61 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this FPIF61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this FPIF61 can only be accessed by the allowed processor CID. Dis allowed CID write to this FPIF61 is discarded and read returns 0.
This bit is set when the falling edge event arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No falling edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>falling edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_SECCFGR2</name>
          <displayName>EXTI2_SECCFGR2</displayName>
          <description>EXTI2 security enable register </description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC33</name>
              <description>Security enable on event input 33.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC34</name>
              <description>Security enable on event input 34.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC35</name>
              <description>Security enable on event input 35.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC36</name>
              <description>Security enable on event input 36.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC37</name>
              <description>Security enable on event input 37.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC38</name>
              <description>Security enable on event input 38.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC40</name>
              <description>Security enable on event input 40.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC41</name>
              <description>Security enable on event input 41.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC42</name>
              <description>Security enable on event input 42.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC43</name>
              <description>Security enable on event input 43.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC44</name>
              <description>Security enable on event input 44.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC46</name>
              <description>Security enable on event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC47</name>
              <description>Security enable on event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC48</name>
              <description>Security enable on event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC49</name>
              <description>Security enable on event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC50</name>
              <description>Security enable on event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC51</name>
              <description>Security enable on event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC52</name>
              <description>Security enable on event input 52.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC53</name>
              <description>Security enable on event input 53.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC54</name>
              <description>Security enable on event input 54.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC55</name>
              <description>Security enable on event input 55.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC56</name>
              <description>Security enable on event input 56.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC59</name>
              <description>Security enable on event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC60</name>
              <description>Security enable on event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC61</name>
              <description>Security enable on event input 61.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC62</name>
              <description>Security enable on event input 62.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC63</name>
              <description>Security enable on event input 63.
When CID filtering is disabled in EXTI2_E63CIDCFGR this SEC63 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E63CIDCFGR this SEC63 can only be accessed by the allowed processor CID. Dis allowed CID write to this SEC63 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (non-secure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
