STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_PRIVCFGR2</name>
          <displayName>EXTI2_PRIVCFGR2</displayName>
          <description>EXTI2 Privilege enable register </description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV33</name>
              <description>Privilege enable on event input 33.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV34</name>
              <description>Privilege enable on event input 34.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV35</name>
              <description>Privilege enable on event input 35.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV36</name>
              <description>Privilege enable on event input 36.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV37</name>
              <description>Privilege enable on event input 37.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV38</name>
              <description>Privilege enable on event input 38.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV40</name>
              <description>Privilege enable on event input 40.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV41</name>
              <description>Privilege enable on event input 41.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV42</name>
              <description>Privilege enable on event input 42.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV43</name>
              <description>Privilege enable on event input 43.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV44</name>
              <description>Privilege enable on event input 44.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV46</name>
              <description>Privilege enable on event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV47</name>
              <description>Privilege enable on event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV48</name>
              <description>Privilege enable on event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV49</name>
              <description>Privilege enable on event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV50</name>
              <description>Privilege enable on event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV51</name>
              <description>Privilege enable on event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV52</name>
              <description>Privilege enable on event input 52.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV53</name>
              <description>Privilege enable on event input 53.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV54</name>
              <description>Privilege enable on event input 54.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV55</name>
              <description>Privilege enable on event input 55.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV56</name>
              <description>Privilege enable on event input 56.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV59</name>
              <description>Privilege enable on event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV60</name>
              <description>Privilege enable on event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV61</name>
              <description>Privilege enable on event input 61.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV62</name>
              <description>Privilege enable on event input 62.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV63</name>
              <description>Privilege enable on event input 63.
When EXTI2_SECCFGR2.SEC63 is disabled, PRIV63 can be accessed with secure and non-secure access.
When EXTI2_SECCFGR2.SEC63 is enabled, PRIV63 can only be accessed with secure access. Non-secure write to this PRIV63 is discarded.
When CID filtering is disabled in EXTI2_E63CIDCFGR this PRIV63 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E63CIDCFGR this PRIV63 can only be accessed by the allowed processor CID. Dis allowed CID write to this PRIV63 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event privilege disabled (Unprivileged)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event privilege enabled (Privileged)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_RTSR3</name>
          <displayName>EXTI2_RTSR3</displayName>
          <description>EXTI2 rising trigger selection register </description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT64</name>
              <description>Rising trigger event configuration bit of configurable event input 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT65</name>
              <description>Rising trigger event configuration bit of configurable event input 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT66</name>
              <description>Rising trigger event configuration bit of configurable event input 66.
When EXTI2_SECCFGR3.SEC66 is disabled, RT66 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC66 is enabled, RT66 can only be accessed with secure access. Non-secure write to this RT66 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV66 is disabled, RT66 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR3.PRIV66 is enabled, RT66 can only be accessed with privilege access. Unprivileged write to this RT66 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E66CIDCFGR this RT66 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E66CIDCFGR this RT66 can only be accessed by the allowed processor CID. Illegal CID write to this RT66 is discarded and read returns 0.
Note: The configurable event input is edge triggered. No glitch must be generated on this input. If a rising edge on the configurable event input occurs while writing to the register, the associated pending bit is not set.
Rising and falling edge triggers can be set for the same configurable event input. In this case, both edges generate a trigger.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_FTSR3</name>
          <displayName>EXTI2_FTSR3</displayName>
          <description>EXTI2 falling trigger selection register </description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FT64</name>
              <description>Falling trigger event configuration bit of configurable event input 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT65</name>
              <description>Falling trigger event configuration bit of configurable event input 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT66</name>
              <description>Falling trigger event configuration bit of configurable event input 66.
When EXTI2_SECCFGR3.SEC66 is disabled, FT66 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC66 is enabled, FT66 can only be accessed with secure access. Non-secure write to this FT66 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV66 is disabled, FT66 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR3.PRIV66 is enabled, FT66 can only be accessed with privilege access. Unprivileged write to this FT66 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E66CIDCFGR this FT66 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E66CIDCFGR this FT66 can only be accessed by the allowed processor CID. Dis allowed CID write to this FT66 is discarded and read returns 0.
Note: The configurable event input is edge triggered. No glitch must be generated on this input. If a falling edge on the configurable event input occurs while writing to the register, the associated pending bit is not set.
Rising and falling edge triggers can be set for the same configurable event input. In this case, both edges generate a trigger.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_SWIER3</name>
          <displayName>EXTI2_SWIER3</displayName>
          <description>EXTI2 software interrupt event register </description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWI64</name>
              <description>Software interrupt on event 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI65</name>
              <description>Software interrupt on event 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWI66</name>
              <description>Software interrupt on event 66.
When EXTI2_SECCFGR3.SEC66 is disabled, SWI66 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC66 is enabled, SWI66 can only be accessed with secure access. Non-secure write to this SWI66 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV66 is disabled, SWI66 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR3.PRIV66 is enabled, SWI66 can only be accessed with privilege access. Unprivileged write to this SWI66 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E66CIDCFGR this SWI66 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E66CIDCFGR this SWI66 can only be accessed by the allowed processor CID. Dis allowed CID write to this SWI66 is discarded and read returns 0.
A software interrupt is generated independent from the setting in EXTI2_RTSR and EXTI2_FTSR. It always returns 0 when read.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Writing 1 has no effect.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writing a 1 to this bit triggers a rising edge event on event 66. This bit is auto cleared by HW.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_RPR3</name>
          <displayName>EXTI2_RPR3</displayName>
          <description>EXTI2 rising edge pending register </description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPIF64</name>
              <description>configurable event input 64 rising edge pending bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF65</name>
              <description>configurable event input 65 rising edge pending bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPIF66</name>
              <description>configurable event input 66 rising edge pending bit.
When EXTI2_SECCFGR3.SEC66 is disabled, RPIF66 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC66 is enabled, RPIF66 can only be accessed with secure access. Non-secure write to this RPIF66 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV66 is disabled, RPIF66 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR3.PRIV66 is enabled, RPIF66 can only be accessed with privilege access. Unprivileged write to this RPIF66 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E66CIDCFGR this RPIF66 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E66CIDCFGR this RPIF66 can only be accessed by the allowed processor CID. Dis allowed CID write to this RPIF66 is discarded and read returns 0.
This bit is set when the selected rising edge event or an EXTI2_SWIER Software trigger arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>selected rising edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_FPR3</name>
          <displayName>EXTI2_FPR3</displayName>
          <description>EXTI2 falling edge pending register </description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPIF64</name>
              <description>configurable event input 64 falling edge pending bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF65</name>
              <description>configurable event input 65 falling edge pending bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIF66</name>
              <description>configurable event input 66 falling edge pending bit.
When EXTI2_SECCFGR3.SEC66 is disabled, FPIF66 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC66 is enabled, FPIF66 can only be accessed with secure access. Non-secure write to this FPIF66 is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV66 is disabled, FPIF66 can be accessed with unprivileged and privilege access.
When EXTI2_PRIVCFGR3.PRIV66 is enabled, FPIF66 can only be accessed with privilege access. Unprivileged write to this FPIF66 is discarded, unprivileged read returns 0.
When CID filtering is disabled in EXTI2_E66CIDCFGR this FPIF66 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E66CIDCFGR this FPIF66 can only be accessed by the allowed processor CID. Dis allowed CID write to this FPIF66 is discarded and read returns 0.
This bit is set when the falling edge event arrives on the configurable event line. This bit is cleared by writing a 1 into the bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No falling edge trigger request occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>falling edge trigger request occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
