STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_SECCFGR3</name>
          <displayName>EXTI2_SECCFGR3</displayName>
          <description>EXTI2 security enable register </description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC64</name>
              <description>Security enable on event input 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC65</name>
              <description>Security enable on event input 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC66</name>
              <description>Security enable on event input 66.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC67</name>
              <description>Security enable on event input 67.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC68</name>
              <description>Security enable on event input 68.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC69</name>
              <description>Security enable on event input 69.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC70</name>
              <description>Security enable on event input 70.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC76</name>
              <description>Security enable on event input 76.
When CID filtering is disabled in EXTI2_E76CIDCFGR this SEC76 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E76CIDCFGR this SEC76 can only be accessed by the allowed processor CID. Dis allowed CID write to this SEC76 is discarded and read returns 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (non-secure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_PRIVCFGR3</name>
          <displayName>EXTI2_PRIVCFGR3</displayName>
          <description>EXTI2 Privilege enable register </description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV64</name>
              <description>Privilege enable on event input 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV65</name>
              <description>Privilege enable on event input 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV66</name>
              <description>Privilege enable on event input 66.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV67</name>
              <description>Privilege enable on event input 67.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV68</name>
              <description>Privilege enable on event input 68.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV69</name>
              <description>Privilege enable on event input 69.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV70</name>
              <description>Privilege enable on event input 70.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV76</name>
              <description>Privilege enable on event input 76.
When EXTI2_SECCFGR3.SEC76 is disabled, PRIV76 can be accessed with secure and non-secure access.
When EXTI2_SECCFGR3.SEC76 is enabled, PRIV76 can only be written with secure access. Non-secure write to this PRIV76 is discarded.
When CID filtering is disabled in EXTI2_E76CIDCFGR this PRIV76 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E76CIDCFGR this PRIV76 can only be accessed by the allowed processor CID. Dis allowed CID write to this PRIV76 is discarded and read returns 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event privilege disabled (Unprivileged)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event privilege enabled (Privileged)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_EXTICR1</name>
          <displayName>EXTI2_EXTICR1</displayName>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI0 GPIO port selection.
These bits are written by software to select the source input for EXTIm external interrupt.
When EXTI2_SECCFGR1.SEC0 is disabled, EXTI0 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC0 is enabled, EXTI0 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV0 is disabled, EXTI0 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV0 is enabled, EXTI0 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E0CIDCFGR is disabled, EXTI0 can be accessed by any processor CID.
When CID filtering in EXTI2_E0CIDCFGR is enabled, EXTI0 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI0 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA0 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB0 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC0 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD0 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE0 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF0 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG0 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH0 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI0 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ0 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>PK0 pin</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ0 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI1 GPIO port selection.
These bits are written by software to select the source input for EXTI1 external interrupt.
When EXTI2_SECCFGR1.SEC1 is disabled, EXTI1 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC1 is enabled, EXTI1 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV1 is disabled, EXTI1 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV1 is enabled, EXTI1 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E1CIDCFGR is disabled, EXTI1 can be accessed by any processor CID.
When CID filtering in EXTI2_E1CIDCFGR is enabled, EXTI1 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI1 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA1 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB1 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC1 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD1 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE1 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF1 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG1 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH1 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI1 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ1 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>PK1 pin</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ1 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI2</name>
              <description>EXTI2 GPIO port selection.
These bits are written by software to select the source input for EXTI2 external interrupt.
When EXTI2_SECCFGR1.SEC2 is disabled, EXTI2 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC2 is enabled, EXTI2 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV2 is disabled, EXTI2 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV2 is enabled, EXTI2 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E2CIDCFGR is disabled, EXTI2 can be accessed by any processor CID.
When CID filtering in EXTI2_E2CIDCFGR is enabled, EXTI2 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI2 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA2 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB2 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC2 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD2 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE2 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF2 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG2 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH2 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI2 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ2 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>PK2 pin</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ2 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI3 GPIO port selection.
These bits are written by software to select the source input for EXTI3 external interrupt.
When EXTI2_SECCFGR1.SEC3 is disabled, EXTI3 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC3 is enabled, EXTI3 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV3 is disabled, EXTI3 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV3 is enabled, EXTI3 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E3CIDCFGR is disabled, EXTI3 can be accessed by any processor CID.
When CID filtering in EXTI2_E3CIDCFGR is enabled, EXTI3 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI3 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA3 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB3 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC3 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD3 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE3 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF3 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG3 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH3 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI3 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ3 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>PK3 pin</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ3 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
