STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_EXTICR3</name>
          <displayName>EXTI2_EXTICR3</displayName>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>EXTI8 GPIO port selection.
These bits are written by software to select the source input for EXTI8 external interrupt.
When EXTI2_SECCFGR1.SEC8 is disabled, EXTI8 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC8 is enabled, EXTI8 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV8 is disabled, EXTI8 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV8 is enabled, EXTI8 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E8CIDCFGR is disabled, EXTI8 can be accessed by any processor CID.
When CID filtering in EXTI2_E8CIDCFGR is enabled, EXTI8 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI8 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA8 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB8 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC8 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD8 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE8 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF8 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG8 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH8 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI8 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ8 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ8 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI9 GPIO port selection.
These bits are written by software to select the source input for EXTI9 external interrupt.
When EXTI2_SECCFGR1.SEC9 is disabled, EXTI9 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC9 is enabled, EXTI9 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV9 is disabled, EXTI9 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV9 is enabled, EXTI9 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E9CIDCFGR is disabled, EXTI9 can be accessed by any processor CID.
When CID filtering in EXTI2_E9CIDCFGR is enabled, EXTI9 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI9 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA9 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB9 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC9 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD9 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE9 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF9 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG9 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH9 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI9 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ9 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>PZ9 pin</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI10 GPIO port selection.
These bits are written by software to select the source input for EXTI10 external interrupt.
When EXTI2_SECCFGR1.SEC10 is disabled, EXTI10 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC10 is enabled, EXTI10 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV10 is disabled, EXTI10 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV10 is enabled, EXTI10 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E10CIDCFGR is disabled, EXTI10 can be accessed by any processor CID.
When CID filtering in EXTI2_E10CIDCFGR is enabled, EXTI10 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI10 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA10 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB10 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC10 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD10 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE10 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF10 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG10 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH10 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI10 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ10 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI11 GPIO port selection.
These bits are written by software to select the source input for EXTI11 external interrupt.
When EXTI2_SECCFGR1.SEC11 is disabled, EXTI11 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC11 is enabled, EXTI11 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV11 is disabled, EXTI11 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV11 is enabled, EXTI11 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E11CIDCFGR is disabled, EXTI11 can be accessed by any processor CID.
When CID filtering in EXTI2_E11CIDCFGR is enabled, EXTI11 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI11 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA11 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB11 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC11 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD11 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE11 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF11 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG11 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH11 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI11 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ11 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
