STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_EXTICR4</name>
          <displayName>EXTI2_EXTICR4</displayName>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>EXTIp GPIO port selection.
These bits are written by software to select the source input for EXTI12 external interrupt.
When EXTI2_SECCFGR1.SEC12 is disabled, EXTI12 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC12 is enabled, EXTI12 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV12 is disabled, EXTI12 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV12 is enabled, EXTI12 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E12CIDCFGR is disabled, EXTI12 can be accessed by any processor CID.
When CID filtering in EXTI2_E12CIDCFGR is enabled, EXTI12 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI12 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA12 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB12 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC12 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD12 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE12 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF12 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG12 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH12 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI12 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ12 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI13 GPIO port selection.
These bits are written by software to select the source input for EXTI13 external interrupt.
When EXTI2_SECCFGR1.SEC13 is disabled, EXTI13 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC13 is enabled, EXTI13 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV13 is disabled, EXTI13 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV13 is enabled, EXTI13 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E13CIDCFGR is disabled, EXTI13 can be accessed by any processor CID.
When CID filtering in EXTI2_E13CIDCFGR is enabled, EXTI13 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI13 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA13 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB13 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC13 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD13 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE13 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF13 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG13 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>PH13 pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI13 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ13 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI14 GPIO port selection.
These bits are written by software to select the source input for EXTI14 external interrupt.
When EXTI2_SECCFGR1.SEC14 is disabled, EXTI14 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC14 is enabled, EXTI14 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV14 is disabled, EXTI14 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV14 is enabled, EXTI14 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E14CIDCFGR is disabled, EXTI14 can be accessed by any processor CID.
When CID filtering in EXTI2_E14CIDCFGR is enabled, EXTI14 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI14 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA14 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB14 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC14 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD14 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE14 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF14 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG14 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI14 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ14 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI15 GPIO port selection.
These bits are written by software to select the source input for EXTI15 external interrupt.
When EXTI2_SECCFGR1.SEC15 is disabled, EXTI15 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC15 is enabled, EXTI15 can only be accessed with secure access. Non-secure write is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV15 is disabled, EXTI15 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV15 is enabled, EXTI15 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering in EXTI2_E15CIDCFGR is disabled, EXTI15 can be accessed by any processor CID.
When CID filtering in EXTI2_E15CIDCFGR is enabled, EXTI15 can only be accessed by the allowed processor CID. Dis allowed CID write to EXTI15 is discarded and read returns 0.
Others: reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PA15 pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PB15 pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>PC15 pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PD15 pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>PE15 pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>PF15 pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>PG15 pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>PI15 pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>PJ15 pin</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_LOCKR</name>
          <displayName>EXTI2_LOCKR</displayName>
          <description>EXTI2 lock register </description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GLOCK</name>
              <description>Global security, privilege and CID configuration registers EXTI2_SECCFGRx, EXTI2_PRIVCFGRx, EXTI2_EnCIDCFGR and EXTI2_CmCIDCFGR lock.
This register bit is write once after reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Security and privilege configuration open, can be modified.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Security and privilege configuration locked, can no longer be modified.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
