STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_C1IMR1</name>
          <displayName>EXTI2_C1IMR1</displayName>
          <description>EXTI2 CPU1 wakeup with interrupt mask register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM0</name>
              <description>CPUm wakeup with interrupt mask on event input 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM1</name>
              <description>CPUm wakeup with interrupt mask on event input 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM2</name>
              <description>CPUm wakeup with interrupt mask on event input 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM3</name>
              <description>CPUm wakeup with interrupt mask on event input 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM4</name>
              <description>CPUm wakeup with interrupt mask on event input 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM5</name>
              <description>CPUm wakeup with interrupt mask on event input 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM6</name>
              <description>CPUm wakeup with interrupt mask on event input 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM7</name>
              <description>CPUm wakeup with interrupt mask on event input 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM8</name>
              <description>CPUm wakeup with interrupt mask on event input 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM9</name>
              <description>CPUm wakeup with interrupt mask on event input 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM10</name>
              <description>CPUm wakeup with interrupt mask on event input 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM11</name>
              <description>CPUm wakeup with interrupt mask on event input 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM12</name>
              <description>CPUm wakeup with interrupt mask on event input 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM13</name>
              <description>CPUm wakeup with interrupt mask on event input 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM14</name>
              <description>CPUm wakeup with interrupt mask on event input 14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM15</name>
              <description>CPUm wakeup with interrupt mask on event input 15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM16</name>
              <description>CPUm wakeup with interrupt mask on event input 16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM17</name>
              <description>CPUm wakeup with interrupt mask on event input 17.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM18</name>
              <description>CPUm wakeup with interrupt mask on event input 18.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM19</name>
              <description>CPUm wakeup with interrupt mask on event input 19.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM20</name>
              <description>CPUm wakeup with interrupt mask on event input 20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM21</name>
              <description>CPUm wakeup with interrupt mask on event input 21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM22</name>
              <description>CPUm wakeup with interrupt mask on event input 22.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM23</name>
              <description>CPUm wakeup with interrupt mask on event input 23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM24</name>
              <description>CPUm wakeup with interrupt mask on event input 24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM25</name>
              <description>CPUm wakeup with interrupt mask on event input 25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM26</name>
              <description>CPUm wakeup with interrupt mask on event input 26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM27</name>
              <description>CPUm wakeup with interrupt mask on event input 27.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM29</name>
              <description>CPUm wakeup with interrupt mask on event input 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM30</name>
              <description>CPUm wakeup with interrupt mask on event input 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM31</name>
              <description>CPUm wakeup with interrupt mask on event input 31.
When EXTI2_SECCFGR1.SEC31 is disabled, IM31 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SEC31 is enabled, IM31 can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIV31 is disabled, IM31 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIV31 is enabled, IM31 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_E31CIDCFGR this IM31 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E31CIDCFGR this IM31 can only be accessed by the allowed processor CID. Dis allowed CID write to this IM31 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup and interrupt CPU(m) from input event n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup and interrupt CPU(m) from input event n is unmasked. CPU(m) wakeup event and configurable event interrupt generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_C1IMR2</name>
          <displayName>EXTI2_C1IMR2</displayName>
          <description>EXTI2 CPU1 wakeup with interrupt mask register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM33</name>
              <description>CPUm wakeup with interrupt mask on event input 33.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM34</name>
              <description>CPUm wakeup with interrupt mask on event input 34.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM35</name>
              <description>CPUm wakeup with interrupt mask on event input 35.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM36</name>
              <description>CPUm wakeup with interrupt mask on event input 36.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM37</name>
              <description>CPUm wakeup with interrupt mask on event input 37.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM38</name>
              <description>CPUm wakeup with interrupt mask on event input 38.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM40</name>
              <description>CPUm wakeup with interrupt mask on event input 40.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM41</name>
              <description>CPUm wakeup with interrupt mask on event input 41.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM42</name>
              <description>CPUm wakeup with interrupt mask on event input 42.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM43</name>
              <description>CPUm wakeup with interrupt mask on event input 43.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM44</name>
              <description>CPUm wakeup with interrupt mask on event input 44.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM46</name>
              <description>CPUm wakeup with interrupt mask on event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM47</name>
              <description>CPUm wakeup with interrupt mask on event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM48</name>
              <description>CPUm wakeup with interrupt mask on event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM49</name>
              <description>CPUm wakeup with interrupt mask on event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM50</name>
              <description>CPUm wakeup with interrupt mask on event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM51</name>
              <description>CPUm wakeup with interrupt mask on event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM52</name>
              <description>CPUm wakeup with interrupt mask on event input 52.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM53</name>
              <description>CPUm wakeup with interrupt mask on event input 53.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM54</name>
              <description>CPUm wakeup with interrupt mask on event input 54.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM55</name>
              <description>CPUm wakeup with interrupt mask on event input 55.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM56</name>
              <description>CPUm wakeup with interrupt mask on event input 56.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM59</name>
              <description>CPUm wakeup with interrupt mask on event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM60</name>
              <description>CPUm wakeup with interrupt mask on event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM61</name>
              <description>CPUm wakeup with interrupt mask on event input 61.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM62</name>
              <description>CPUm wakeup with interrupt mask on event input 62.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM63</name>
              <description>CPUm wakeup with interrupt mask on event input 63.
When EXTI2_SECCFGR2.SEC63 is disabled, IM63 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC63 is enabled, IM63 can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV63 is disabled, IM63 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR2.PRIV63 is enabled, IM63 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_E63CIDCFGR this IM63 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E63CIDCFGR this IM63 can only be accessed by the allowed processor CID. Dis allowed CID write to this IM63 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup and interrupt CPU(m) from input event 63 is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup and interrupt CPU(m) from input event 63 is unmasked. CPU(m) wakeup event and configurable event interrupt generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
