STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_C2EMR1</name>
          <displayName>EXTI2_C2EMR1</displayName>
          <description>EXTI2 CPU2 wakeup with event mask register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EM0</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM1</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM2</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM3</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM4</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM5</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM6</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM7</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM8</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM9</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM10</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM11</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM12</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM13</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM14</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
