STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM15</name>
              <description>CPU(m) wakeup with event generation mask on event input n. (where n = 15 to 0)
When EXTI2_SECCFGR1.SECENn is disabled, EMn can be accessed with non-secure and secure access.
When EXTI2_SECCFGR1.SECENn is enabled, EMn can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR1.PRIVn is disabled, EMn can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR1.PRIVn is enabled, EMn can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_EnCIDCFGR this EMn can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_EnCIDCFGR this EMn can only be accessed by the allowed processor CID. Dis allowed CID write to this EMn is discarded and read returns 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line n is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_C2IMR2</name>
          <displayName>EXTI2_C2IMR2</displayName>
          <description>EXTI2 CPU2 wakeup with interrupt mask register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM33</name>
              <description>CPUm wakeup with interrupt mask on event input 33.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM34</name>
              <description>CPUm wakeup with interrupt mask on event input 34.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM35</name>
              <description>CPUm wakeup with interrupt mask on event input 35.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM36</name>
              <description>CPUm wakeup with interrupt mask on event input 36.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM37</name>
              <description>CPUm wakeup with interrupt mask on event input 37.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM38</name>
              <description>CPUm wakeup with interrupt mask on event input 38.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM40</name>
              <description>CPUm wakeup with interrupt mask on event input 40.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM41</name>
              <description>CPUm wakeup with interrupt mask on event input 41.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM42</name>
              <description>CPUm wakeup with interrupt mask on event input 42.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM43</name>
              <description>CPUm wakeup with interrupt mask on event input 43.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM44</name>
              <description>CPUm wakeup with interrupt mask on event input 44.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM46</name>
              <description>CPUm wakeup with interrupt mask on event input 46.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM47</name>
              <description>CPUm wakeup with interrupt mask on event input 47.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM48</name>
              <description>CPUm wakeup with interrupt mask on event input 48.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM49</name>
              <description>CPUm wakeup with interrupt mask on event input 49.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM50</name>
              <description>CPUm wakeup with interrupt mask on event input 50.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM51</name>
              <description>CPUm wakeup with interrupt mask on event input 51.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM52</name>
              <description>CPUm wakeup with interrupt mask on event input 52.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM53</name>
              <description>CPUm wakeup with interrupt mask on event input 53.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM54</name>
              <description>CPUm wakeup with interrupt mask on event input 54.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM55</name>
              <description>CPUm wakeup with interrupt mask on event input 55.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM56</name>
              <description>CPUm wakeup with interrupt mask on event input 56.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM59</name>
              <description>CPUm wakeup with interrupt mask on event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM60</name>
              <description>CPUm wakeup with interrupt mask on event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM61</name>
              <description>CPUm wakeup with interrupt mask on event input 61.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM62</name>
              <description>CPUm wakeup with interrupt mask on event input 62.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM63</name>
              <description>CPUm wakeup with interrupt mask on event input 63.
When EXTI2_SECCFGR2.SEC63 is disabled, IM63 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC63 is enabled, IM63 can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV63 is disabled, IM63 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR2.PRIV63 is enabled, IM63 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_E63CIDCFGR this IM63 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E63CIDCFGR this IM63 can only be accessed by the allowed processor CID. Dis allowed CID write to this IM63 is discarded and read returns 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup and interrupt CPU(m) from input event 63 is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup and interrupt CPU(m) from input event 63 is unmasked. CPU(m) wakeup event and configurable event interrupt generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_C2EMR2</name>
          <displayName>EXTI2_C2EMR2</displayName>
          <description>EXTI2 CPU2 wakeup with event mask register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EM59</name>
              <description>CPU(m) wakeup with event generation mask on event input 59.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM60</name>
              <description>CPU(m) wakeup with event generation mask on event input 60.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM61</name>
              <description>CPU(m) wakeup with event generation mask on event input 61.
When EXTI2_SECCFGR2.SEC61 is disabled, EM61 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR2.SEC61 is enabled, EM61 can only be accessed with secure access. Non-secure write to this bit x is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR2.PRIV61 is disabled, EM61 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR2.PRIV61 is enabled, EM61 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_E61CIDCFGR this EM61 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E61CIDCFGR this EM61 can only be accessed by the allowed processor CID. Dis allowed CID write to this EM61 is discarded and read returns 0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup with event generation from line 61 is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup with event generation from line 61 is unmasked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_C2IMR3</name>
          <displayName>EXTI2_C2IMR3</displayName>
          <description>EXTI2 CPU2 wakeup with interrupt mask register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM64</name>
              <description>CPUm wakeup with interrupt mask on event input 64.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM65</name>
              <description>CPUm wakeup with interrupt mask on event input 65.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM66</name>
              <description>CPUm wakeup with interrupt mask on event input 66.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM67</name>
              <description>CPUm wakeup with interrupt mask on event input 67.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM68</name>
              <description>CPUm wakeup with interrupt mask on event input 68.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM69</name>
              <description>CPUm wakeup with interrupt mask on event input 69.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM70</name>
              <description>CPUm wakeup with interrupt mask on event input 70.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM76</name>
              <description>CPUm wakeup with interrupt mask on event input 76.
When EXTI2_SECCFGR3.SEC76 is disabled, IM76 can be accessed with non-secure and secure access.
When EXTI2_SECCFGR3.SEC76 is enabled, IM76 can only be accessed with secure access. Non-secure write to this bit is discarded, non-secure read returns 0.
When EXTI2_PRIVCFGR3.PRIV76 is disabled, IM76 can be accessed with privilege and unprivileged access.
When EXTI2_PRIVCFGR3.PRIV76 is enabled, IM76 can only be accessed with privilege access. Unprivileged write to this bit is discarded and read returns 0.
When CID filtering is disabled in EXTI2_E76CIDCFGR this IM76 can be accessed by any processor CID.
When CID filtering is enabled in EXTI2_E76CIDCFGR this IM76 can only be accessed by the allowed processor CID. Dis allowed CID write to this IM76 is discarded and read returns 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>wakeup and interrupt CPU(m) from input event n is masked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>wakeup and interrupt CPU(m) from input event n is unmasked. CPU(m) wakeup event and configurable event interrupt generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
