STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_E3CIDCFGR</name>
          <displayName>EXTI2_E3CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E4CIDCFGR</name>
          <displayName>EXTI2_E4CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E5CIDCFGR</name>
          <displayName>EXTI2_E5CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E6CIDCFGR</name>
          <displayName>EXTI2_E6CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E7CIDCFGR</name>
          <displayName>EXTI2_E7CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E8CIDCFGR</name>
          <displayName>EXTI2_E8CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E9CIDCFGR</name>
          <displayName>EXTI2_E9CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E10CIDCFGR</name>
          <displayName>EXTI2_E10CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E11CIDCFGR</name>
          <displayName>EXTI2_E11CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E12CIDCFGR</name>
          <displayName>EXTI2_E12CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E13CIDCFGR</name>
          <displayName>EXTI2_E13CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E14CIDCFGR</name>
          <displayName>EXTI2_E14CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E15CIDCFGR</name>
          <displayName>EXTI2_E15CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E16CIDCFGR</name>
          <displayName>EXTI2_E16CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
