STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_E17CIDCFGR</name>
          <displayName>EXTI2_E17CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E18CIDCFGR</name>
          <displayName>EXTI2_E18CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E19CIDCFGR</name>
          <displayName>EXTI2_E19CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E20CIDCFGR</name>
          <displayName>EXTI2_E20CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E21CIDCFGR</name>
          <displayName>EXTI2_E21CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E22CIDCFGR</name>
          <displayName>EXTI2_E22CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E23CIDCFGR</name>
          <displayName>EXTI2_E23CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E24CIDCFGR</name>
          <displayName>EXTI2_E24CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E25CIDCFGR</name>
          <displayName>EXTI2_E25CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E26CIDCFGR</name>
          <displayName>EXTI2_E26CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E27CIDCFGR</name>
          <displayName>EXTI2_E27CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E28CIDCFGR</name>
          <displayName>EXTI2_E28CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E29CIDCFGR</name>
          <displayName>EXTI2_E29CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E30CIDCFGR</name>
          <displayName>EXTI2_E30CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
