STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_E31CIDCFGR</name>
          <displayName>EXTI2_E31CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E32CIDCFGR</name>
          <displayName>EXTI2_E32CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E33CIDCFGR</name>
          <displayName>EXTI2_E33CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E34CIDCFGR</name>
          <displayName>EXTI2_E34CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E35CIDCFGR</name>
          <displayName>EXTI2_E35CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E36CIDCFGR</name>
          <displayName>EXTI2_E36CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E37CIDCFGR</name>
          <displayName>EXTI2_E37CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E38CIDCFGR</name>
          <displayName>EXTI2_E38CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E39CIDCFGR</name>
          <displayName>EXTI2_E39CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E40CIDCFGR</name>
          <displayName>EXTI2_E40CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E41CIDCFGR</name>
          <displayName>EXTI2_E41CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E42CIDCFGR</name>
          <displayName>EXTI2_E42CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E43CIDCFGR</name>
          <displayName>EXTI2_E43CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E44CIDCFGR</name>
          <displayName>EXTI2_E44CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
