STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>EXTI2_E59CIDCFGR</name>
          <displayName>EXTI2_E59CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x26c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E60CIDCFGR</name>
          <displayName>EXTI2_E60CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E61CIDCFGR</name>
          <displayName>EXTI2_E61CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E62CIDCFGR</name>
          <displayName>EXTI2_E62CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E63CIDCFGR</name>
          <displayName>EXTI2_E63CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x27c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E64CIDCFGR</name>
          <displayName>EXTI2_E64CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E65CIDCFGR</name>
          <displayName>EXTI2_E65CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E66CIDCFGR</name>
          <displayName>EXTI2_E66CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E67CIDCFGR</name>
          <displayName>EXTI2_E67CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x28c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E68CIDCFGR</name>
          <displayName>EXTI2_E68CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E69CIDCFGR</name>
          <displayName>EXTI2_E69CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E70CIDCFGR</name>
          <displayName>EXTI2_E70CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E71CIDCFGR</name>
          <displayName>EXTI2_E71CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI2_E72CIDCFGR</name>
          <displayName>EXTI2_E72CIDCFGR</displayName>
          <description>EXTI2 event CID Config register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>EXTI event n CID filtering enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable EXTI event n filtering. (EXTI event n can be accessed by all CIDs)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable EXTI event n filtering. (EXTI event n can only be accessed by the processor with CID = CPUm CID.)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>EXTI event n allowed CID value.
If CID filtering is disabled in CFEN, these bits are ignored, else:
EXITI event n allowed processor CID number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
