STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>GPIOZ_HWCFGR8</name>
          <displayName>GPIOZ_HWCFGR8</displayName>
          <description>GPIO port Z hardware configuration register 8</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_AF_IO0</name>
              <description>Indicate which is the fastest AF for I/O0 (0 to F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO1</name>
              <description>Indicate which is the fastest AF for I/O1 (0 to F)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO2</name>
              <description>Indicate which is the fastest AF for I/O2 (0 to F)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO3</name>
              <description>Indicate which is the fastest AF for I/O3 (0 to F)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO4</name>
              <description>Indicate which is the fastest AF for I/O4 (0 to F)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO5</name>
              <description>Indicate which is the fastest AF for I/O5 (0 to F)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO6</name>
              <description>Indicate which is the fastest AF for I/O6 (0 to F)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_AF_IO7</name>
              <description>Indicate which is the fastest AF for I/O7 (0 to F)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR7</name>
          <displayName>GPIOZ_HWCFGR7</displayName>
          <description>GPIO port Z hardware configuration register 7</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODER_RES</name>
              <description>MODER register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR6</name>
          <displayName>GPIOZ_HWCFGR6</displayName>
          <description>GPIO port Z hardware configuration register 6</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PUPDR_RES</name>
              <description>Pull-up/pull-down register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR5</name>
          <displayName>GPIOZ_HWCFGR5</displayName>
          <description>GPIO port Z hardware configuration register 5</description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSPEED_RES</name>
              <description>OSPEED register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR4</name>
          <displayName>GPIOZ_HWCFGR4</displayName>
          <description>GPIO port Z hardware configuration register 4</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ODR_RES</name>
              <description>Output data register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTYPER_RES</name>
              <description>Output type register reset value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR3</name>
          <displayName>GPIOZ_HWCFGR3</displayName>
          <description>GPIO port Z hardware configuration register 3</description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFRL_RES</name>
              <description>AF register low reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR2</name>
          <displayName>GPIOZ_HWCFGR2</displayName>
          <description>GPIO port Z hardware configuration register 2</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFRH_RES</name>
              <description>AF register high reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_HWCFGR1</name>
          <displayName>GPIOZ_HWCFGR1</displayName>
          <description>GPIO port Z hardware configuration register 1</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OR_RES</name>
              <description>Option register reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_VERR</name>
          <displayName>GPIOZ_VERR</displayName>
          <description>GPIO port Z version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MINREV</name>
              <description>GPIO minor revision
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJREV</name>
              <description>GPIO major revision
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_IPIDR</name>
          <displayName>GPIOZ_IPIDR</displayName>
          <description>GPIO port Z identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000F0004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPID</name>
              <description>GPIO identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOZ_SIDR</name>
          <displayName>GPIOZ_SIDR</displayName>
          <description>GPIO port Z size identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SID</name>
              <description>Size identifier
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
