STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>HSEM_C2ICR</name>
          <displayName>HSEM_C2ICR</displayName>
          <description>HSEM non-secure interrupt clear register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISC</name>
              <description>Non-secure Interrupt(n) semaphore x clear bit
This bit is written by software, and is always read 0.
When semaphore x SECx is disabled, bit x can be accessed with secure and non-secure access.
When semaphore x SECx is enabled, bit x cannot be accessed, write to this bit is discarded.
When semaphore x PRIVx is disabled, bit x can be accessed with privileged and unprivileged access.
When semaphore x PRIVx is enabled, bit x can only be accessed with privileged access. Unprivileged write to this bit is discarded.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according to the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>non-secure Interrupt(n) semaphore x status ISFx and masked status MISFx not affected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>non-secure Interrupt(n) semaphore x status ISFx and masked status MISFx cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C2ISR</name>
          <displayName>HSEM_C2ISR</displayName>
          <description>HSEM non-secure interrupt status register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISF</name>
              <description>Interrupt semaphore x status bit before enable (mask)
This bit is set by hardware, and reset only by software. This bit is cleared by software writing the corresponding HSEM_CnICR bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Interrupt semaphore x status, no interrupt pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Interrupt semaphore x status, interrupt pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C2MISR</name>
          <displayName>HSEM_C2MISR</displayName>
          <description>HSEM non-secure interrupt status register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MISF</name>
              <description>Masked non-secure interrupt(n) semaphore x status bit after enable (mask)
This bit is set by hardware and read only by software. This bit is cleared by software writing the corresponding HSEM_CnICR bit. This bit is read as 0 when semaphore x status is masked in HSEM_CnIER bit x.
When semaphore x SECx is disabled, bit x can be accessed with secure and non-secure access.
When semaphore x SECx is enabled, bit x cannot be accessed, read returns 0.
When semaphore x PRIVx is disabled, bit x can be accessed with privileged and unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with privileged access. Unprivileged read returns 0.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>non-secure interrupt(n) semaphore x status after masking not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>non-secure interrupt(n) semaphore x status after masking pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C3IER</name>
          <displayName>HSEM_C3IER</displayName>
          <description>HSEM non-secure interrupt enable register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISE</name>
              <description>Non-secure Interrupt(n) semaphore x enable bit
This bit is read and written by software.
When semaphore x SECx is disabled, bit x can be accessed with secure and non-secure access.
When semaphore x SECx is enabled, bit x is forced to 0 and cannot be accessed, write to this bit is discarded and a read returns 0.
When semaphore x PRIVx is disabled, bit x can be accessed with privilege and unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with privileged access. Unprivileged write to this bit is discarded, unprivileged read returns 0.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can only be accessed by the processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to zero and can't be accessed, writing to this bit is discarded and read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure Interrupt(n) generation for semaphore x disabled (masked)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Non-secure Interrupt(n) generation for semaphore x enabled (not masked)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C3ICR</name>
          <displayName>HSEM_C3ICR</displayName>
          <description>HSEM non-secure interrupt clear register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISC</name>
              <description>Non-secure Interrupt(n) semaphore x clear bit
This bit is written by software, and is always read 0.
When semaphore x SECx is disabled, bit x can be accessed with secure and non-secure access.
When semaphore x SECx is enabled, bit x cannot be accessed, write to this bit is discarded.
When semaphore x PRIVx is disabled, bit x can be accessed with privileged and unprivileged access.
When semaphore x PRIVx is enabled, bit x can only be accessed with privileged access. Unprivileged write to this bit is discarded.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according to the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>non-secure Interrupt(n) semaphore x status ISFx and masked status MISFx not affected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>non-secure Interrupt(n) semaphore x status ISFx and masked status MISFx cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C3ISR</name>
          <displayName>HSEM_C3ISR</displayName>
          <description>HSEM non-secure interrupt status register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISF</name>
              <description>Interrupt semaphore x status bit before enable (mask)
This bit is set by hardware, and reset only by software. This bit is cleared by software writing the corresponding HSEM_CnICR bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Interrupt semaphore x status, no interrupt pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Interrupt semaphore x status, interrupt pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C3MISR</name>
          <displayName>HSEM_C3MISR</displayName>
          <description>HSEM non-secure interrupt status register</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MISF</name>
              <description>Masked non-secure interrupt(n) semaphore x status bit after enable (mask)
This bit is set by hardware and read only by software. This bit is cleared by software writing the corresponding HSEM_CnICR bit. This bit is read as 0 when semaphore x status is masked in HSEM_CnIER bit x.
When semaphore x SECx is disabled, bit x can be accessed with secure and non-secure access.
When semaphore x SECx is enabled, bit x cannot be accessed, read returns 0.
When semaphore x PRIVx is disabled, bit x can be accessed with privileged and unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with privileged access. Unprivileged read returns 0.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>non-secure interrupt(n) semaphore x status after masking not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>non-secure interrupt(n) semaphore x status after masking pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC1IER</name>
          <displayName>HSEM_SC1IER</displayName>
          <description>HSEM secure interrupt enable register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISE</name>
              <description>Secure interrupt(n) semaphore x enable bit
This bit is read and written by software.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. secure unprivileged write to this bit is discarded, secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) generation for semaphore x is disabled (masked).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) generation for semaphore x is enabled (not masked).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC1ICR</name>
          <displayName>HSEM_SC1ICR</displayName>
          <description>HSEM secure interrupt clear register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISC</name>
              <description>Secure interrupt(n) semaphore x clear bit
This bit is written by software, and is always read 0.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged write to this bit is discarded.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx not affected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC1ISR</name>
          <displayName>HSEM_SC1ISR</displayName>
          <description>HSEM secure interrupt status register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISF</name>
              <description>Secure interrupt(n) semaphore x status bit before enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status, no interrupt pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status, interrupt pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC1MISR</name>
          <displayName>HSEM_SC1MISR</displayName>
          <description>HSEM secure masked interrupt status register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMISF</name>
              <description>Secure masked interrupt(n) semaphore x status bit after enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
Bit is read as 0 when semaphore x status is masked in HSEM_SCnIER bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status after masking not pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status after masking pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
