STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>HSEM_SC2IER</name>
          <displayName>HSEM_SC2IER</displayName>
          <description>HSEM secure interrupt enable register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISE</name>
              <description>Secure interrupt(n) semaphore x enable bit
This bit is read and written by software.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. secure unprivileged write to this bit is discarded, secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) generation for semaphore x is disabled (masked).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) generation for semaphore x is enabled (not masked).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC2ICR</name>
          <displayName>HSEM_SC2ICR</displayName>
          <description>HSEM secure interrupt clear register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISC</name>
              <description>Secure interrupt(n) semaphore x clear bit
This bit is written by software, and is always read 0.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged write to this bit is discarded.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx not affected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC2ISR</name>
          <displayName>HSEM_SC2ISR</displayName>
          <description>HSEM secure interrupt status register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISF</name>
              <description>Secure interrupt(n) semaphore x status bit before enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status, no interrupt pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status, interrupt pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC2MISR</name>
          <displayName>HSEM_SC2MISR</displayName>
          <description>HSEM secure masked interrupt status register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMISF</name>
              <description>Secure masked interrupt(n) semaphore x status bit after enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
Bit is read as 0 when semaphore x status is masked in HSEM_SCnIER bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status after masking not pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status after masking pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC3IER</name>
          <displayName>HSEM_SC3IER</displayName>
          <description>HSEM secure interrupt enable register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISE</name>
              <description>Secure interrupt(n) semaphore x enable bit
This bit is read and written by software.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. secure unprivileged write to this bit is discarded, secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) generation for semaphore x is disabled (masked).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) generation for semaphore x is enabled (not masked).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC3ICR</name>
          <displayName>HSEM_SC3ICR</displayName>
          <description>HSEM secure interrupt clear register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISC</name>
              <description>Secure interrupt(n) semaphore x clear bit
This bit is written by software, and is always read 0.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged write to this bit is discarded.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, writing to this bit is discarded and read returns 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx not affected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status ISFx and masked status MISFx cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC3ISR</name>
          <displayName>HSEM_SC3ISR</displayName>
          <description>HSEM secure interrupt status register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SISF</name>
              <description>Secure interrupt(n) semaphore x status bit before enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status, no interrupt pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status, interrupt pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SC3MISR</name>
          <displayName>HSEM_SC3MISR</displayName>
          <description>HSEM secure masked interrupt status register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMISF</name>
              <description>Secure masked interrupt(n) semaphore x status bit after enable (mask)
This bit is set by hardware and read only by software.
Bit is cleared by software writing the corresponding HSEM_SCnICR bit x.
Bit is read as 0 when semaphore x status is masked in HSEM_SCnIER bit x.
When semaphore x PRIVx is disabled, bit x can be accessed with secure privilege and secure unprivileged access.
When semaphore x PRIVx is enabled, bit x can be accessed only with secure privilege access. Secure unprivileged read return 0 value.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed according the register global access definition shown above.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can be accessed only by the secure processor(s) as defined in the HSEM_CnCIDCFGR when the processor CID is part of the HSEM_GpCIDCFGR CID white list. When its CID is not in the white list bit x is reset to 0 and cannot be accessed, read return 0 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure interrupt(n) semaphore x status after masking not pending.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure interrupt(n) semaphore x status after masking pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_SECCFGR</name>
          <displayName>HSEM_SECCFGR</displayName>
          <description>HSEM security configuration register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC</name>
              <description>Semaphore x security attribute
This bit is set and cleared by software.
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be written by any secure processor.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can only be written by secure processor CIDs, which are part of the CID white list.
All CIDs have read accesses to the register bit x value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Semaphore x non-security, can be accessed by both secure and non-secure processors. When unlocking semaphore x both a secure and non-secure interrupt can be generated.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Semaphore x security, can be accessed only by secure processors. When unlocking semaphore x only a secure interrupt can be generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_PRIVCFGR</name>
          <displayName>HSEM_PRIVCFGR</displayName>
          <description>HSEM privilege configuration register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV</name>
              <description>Semaphore x privilege attribute
This bit is set and cleared by software.
When semaphore x SECx is disabled, bit x can be write accessed with secure privileged and non-secure privileged access.
When semaphore x SECx is enabled, bit x can only be write accessed with secure privilege access. Non-secure privileged write access is discarded. Both secure and non-secure read return the register bit x value
When semaphore x CID white list is disabled by HSEM_GpCIDCFGR.CFEN, bit x can be written by any privilege processor.
When semaphore x CID white list is enabled by HSEM_GpCIDCFGR.CFEN, bit x can only be written by privileged processor CIDs, which are part of the CID white list.
All CIDs have read accesses to the register bit x value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Semaphore x unprivileged, can be accessed by both privileged and unprivileged processors.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Semaphore x privileged, can be accessed only by privileged processors.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_C1CIDCFGR</name>
          <displayName>HSEM_C1CIDCFGR</displayName>
          <description>HSEM processor 1 CID configuration register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>processor[n] CID filtering enabled for HSEM_(S)CnIER, HSEM_(S)CnICR, HSEM_(S)CnISR, and HSEM_(S)CnMISR registers and for white list filter usage in HSEM_GpCIDCFGR.SEM_WLIST_Cn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disable the CID filtering for processor[n]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enable the CID filtering for processor[n]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CID</name>
              <description>processor[n] CID domain identification
If CFEN = 0 these bits are ignored and there is no processor[n] CID filtering. Else: processor[n] CID domain identification number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
