STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>I3C_RDR</name>
          <displayName>I3C_RDR</displayName>
          <description>I3C receive data byte register </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDB0</name>
              <description>8-bit received data on I3C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_RDWR</name>
          <displayName>I3C_RDWR</displayName>
          <description>I3C receive data word register </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDB0</name>
              <description>8-bit received data (earliest byte on I3C bus).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDB1</name>
              <description>8-bit received data (next byte after RXDB0 on I3C bus).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDB2</name>
              <description>8-bit received data (next byte after RXDB1 on I3C bus).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDB3</name>
              <description>8-bit received data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_TDR</name>
          <displayName>I3C_TDR</displayName>
          <description>I3C transmit data byte register </description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDB0</name>
              <description>8-bit data to transmit on I3C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_TDWR</name>
          <displayName>I3C_TDWR</displayName>
          <description>I3C transmit data word register </description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDB0</name>
              <description>8-bit transmit data (earliest byte on I3C bus)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDB1</name>
              <description>8-bit transmit data (next byte after TXDB0[7:0] on I3C bus).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDB2</name>
              <description>8-bit transmit data (next byte after TXDB1[7:0] on I3C bus).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDB3</name>
              <description>8-bit transmit data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_IBIDR</name>
          <displayName>I3C_IBIDR</displayName>
          <description>I3C IBI payload data register </description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIDB0</name>
              <description>8-bit IBI payload data (earliest byte on I3C bus, i.e. MDB[7:0] mandatory data byte).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB1</name>
              <description>8-bit IBI payload data (next byte on I3C bus after IBIDB0[7:0]).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB2</name>
              <description>8-bit IBI payload data (next byte on I3C bus after IBIDB1[7:0]).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB3</name>
              <description>8-bit IBI payload data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_TGTTDR</name>
          <displayName>I3C_TGTTDR</displayName>
          <description>I3C target transmit configuration register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDCNT</name>
              <description>transmit data counter, in bytes (when I3C is configured as target)
This field must be written by software in the same access when is asserted PRELOAD, in order to define the number of bytes to preload and to transmit.
This field is updated by hardware and reports, when read, the remaining number of bytes to be loaded into the TX-FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>preload of the TX-FIFO (when I3C is configured as target)
This bit must be written and asserted by software in the same access when is written and defined the number of bytes to preload into the TX-FIFO and to transmit.
This bit is cleared by hardware when all the data bytes to transmit are loaded into the TX-FIFO.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no TX-FIFO preload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>TX-FIFO preload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_SR</name>
          <displayName>I3C_SR</displayName>
          <description>I3C status register </description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XDATACNT</name>
              <description>data counter
- When the I3C is acting as controller: number of targets detected on the bus
- When the I3C is acting as target: number of transmitted bytes
- When the I3C is acting as controller: number of data bytes read from or transmitted on the I3C bus detected on the bus during the MID[7:0] message
- When the I3C is acting as target: number of data bytes read from or transmitted on the I3C bus detected on the bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABT</name>
              <description>a private read message is completed/aborted prematurely by the target (when the I3C is acting as controller)
When the I3C is acting as controller, this bit indicates if the private read data which is transmitted by the target early terminates (i.e. the target drives T bit low earlier vs what does expect the controller in terms of programmed number of read data bytes i.e. I3C_CR.DATACNT[15:0]).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no early completion ( abort) from the target</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>early completion/abort from the target</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>message direction
Whatever the I3C is acting as controller or target, this bit indicates the direction of the related message on the I3C bus
Note: ENTDAA CCC is considered as a write command.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>write</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MID</name>
              <description>message identifier/counter of a given frame (when the I3C is acting as controller)
When the I3C is acting as controller, this field identifies the control word message (i.e. I3C_CR) to which the I3C_SR status register refers.
First message of a frame is identified with MID[7:0]=0.
This field is incremented (by hardware) on the completion of a new message control word (i.e. I3C_CR) over I3C bus. This field is reset for every new frame start.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_SER</name>
          <displayName>I3C_SER</displayName>
          <description>I3C status error register </description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CODERR</name>
              <description>protocol error code/type
controller detected an illegally formatted CCC
controller detected that transmitted data on the bus is different from expected
controller detected a not acknowledged broadcast address (7 hE)
controller detected the new controller did not drive bus after bus control hand-off
target detected an invalid broadcast address 7 hE+W
target detected a parity error on a CCC code via a parity check (vs T bit)
target detected a parity error on a write data via a parity check (vs T bit)
target detected a parity error on the assigned address during dynamic address arbitration via a parity check (vs PAR bit)
target detected a 7 hE+R missing after Sr during dynamic address arbitration
target detected an illegally formatted CCC
target detected that transmitted data on the bus is different from expected
others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>M0 error (transaction after sending CCC): </description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>M1 error (monitoring error): </description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>M2 error (no response to broadcast address): </description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>M3 error (failed bus control hand-off): </description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>S0 error (invalid broadcast address 7 hE+W): </description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>S1 error (CCC code): </description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>S2 error (write data): </description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>S3 error (assigned address during dynamic address arbitration): </description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xC</name>
                  <description>S4 error (7 hE+R missing after Sr during dynamic address arbitration): </description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xD</name>
                  <description>S5 error (transaction after detecting CCC): </description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xE</name>
                  <description>S6 error (monitoring error): </description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERR</name>
              <description>protocol error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>whatever controller or target, hardware detected a protocol error, as detailed in CODERR[3:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>SCL stall error (when the I3C is acting as target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>target detected that SCL was stable for more than 125  us during a I3C SDR read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOVR</name>
              <description>RX-FIFO overrun or TX-FIFO underrun
i) a TX-FIFO underrun: TX-FIFO is empty and a write data byte has to be transmitted
ii) a RX-FIFO overrun: RX-FIFO is full and a new data byte is received</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>whatever controller or target, hardware detected either:</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COVR</name>
              <description>C-FIFO underrun or S-FIFO overrun (when the I3C is acting as controller)
i) a C-FIFO underrun: control FIFO is empty and a restart has to be emitted
ii) a S-FIFO overrun: S-FIFO is full and a new message ends</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>controller detected either:</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANACK</name>
              <description>address not acknowledged (when the I3C is configured as controller)
i) a legacy I2C read/write transfer
ii) a direct CCC write transfer
iii) the second trial of a direct CCC read transfer
iv) a private read/write transfer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>controller detected that the static/dynamic address was not acknowledged by a target, either during:</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DNACK</name>
              <description>data not acknowledged (when the I3C is acting as controller)
i) a legacy I2C write transfer
ii) the second trial when sending dynamic address during ENTDAA procedure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>controller detected that a data byte is not acknowledged by a target, either during:</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DERR</name>
              <description>data error (when the I3C is acting as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no detected error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>controller detected a data error during the bus control hand-off procedure (GETACCMST CCC) when the received target address or/and the parity bit do no match. controller keeps bus control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_RXMR</name>
          <displayName>I3C_RXMR</displayName>
          <description>I3C received message register </description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIRXDCNT</name>
              <description>IBI received payload data count (when the I3C is configured as controller)
When the I3C is configured as controller, this field logs the number of data bytes effectively received in the I3C_IBIDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXCODE</name>
              <description>received CCC code (when the I3C is configured as target)
When the I3C is configured as target, this field logs the received CCC code.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXADD</name>
              <description>received target address (when the I3C is configured as controller)
When the I3C is configured as controller, this field logs the received dynamic address from the target during acknowledged IBI or bus control request.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
