STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>I3C_TIMINGR1</name>
          <displayName>I3C_TIMINGR1</displayName>
          <description>I3C timing register 1 </description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVAL</name>
              <description>number of kernel clock cycles, that is used whatever I3C is acting as controller or target, to set the following MIPI I3C timings, like bus available condition time:
When the I3C is acting as target:
for bus available condition time: it must wait for (bus available condition) time to be elapsed after a stop and before issuing a start request for an IBI or a bus control request (i.e. bus free condition is sustained for at least tAVAL). refer to MIPI timing tAVAL = 1  us. This timing is defined by:
tAVAL = (AVAL[7:0] + 2) x tI3CCLK
for bus idle condition time: it must wait for (bus idle condition) time to be elapsed after that both SDA and SCL are continuously high and stable before issuing a hot-join event. Refer to MIPI timing tIDLE = 1ms. This timing is defined by:
tIDLE = (AVAL[7:0] + 2) x 1000 x tI3CCLK
When the I3C is acting as controller, it can not stall the clock beyond a maximum stall time (i.e. stall the SCL clock low), as follows:
on first bit of assigned address during dynamic address assignment: it can not stall the clock beyond the MIPI timing tSTALLDAA = 15 ms. This timing is defined by:
tSTALLDAA = (AVAL[7:0] + 1) x 15000 x tI3CCLK
on ACK/NACK phase of I3C/I2C transfer, on parity bit of write data transfer, on transition bit of I3C read transfer: it can not stall the clock beyond the MIPI timing tSTALL = 100  us. This timing is defined by:
tSTALL = (AVAL[7:0] + 1) x 100 x tI3CCLK
Whatever the I3C is acting as controller or as (controller-capable) target, during a bus control hand-off procedure:
The new master must wait for a time (refer to MIPI timing tMMLOCK) before pulling SDA low (i.e. issuing a start). And the current master must wait for the same time while monitoring new master before testing new master by pulling SDA low. This time to wait is dependent on the defined I3C_TIMINGR1.AM[1:0], as follows:
If AM[1:0]=00: tMMLOCK = (AVAL[7:0] + 1)  x tI3CCLK
If AM[1:0]=01: tMMLOCK = (AVAL[7:0] + 1) x 100 x tI3CCLK
If AM[1:0]=10: tMMLOCK = (AVAL[7:0] + 1) x 2000 x tI3CCLK
If AM[1:0]=11: tMMLOCK = (AVAL[7:0] + 1) x 50000 x tI3CCLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AM</name>
              <description>activity state of the new master (when I3C is acting as controller)
This field indicates the time to wait before being accessed as target, refer to the other field AVAL[7:0].
This field can be modified only when the I3C is acting as controller.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREE</name>
              <description>number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time (when the I3C is acting as controller)
When the I3C is acting as controller:
for I3C start timing: it must wait for (bus free condition) time to be elapsed after a stop and before a start, refer to MIPI timings (I3C) tCAS and (I2C) tBUF. These timings are defined by:
tBUF= tCAS = [ (FREE[6:0]  + 1) x 2 - (0,5 + SDA_HD)] x tI3CCLK
Note: for pure I3C bus: tCASmin= 38,4 ns.
Note: for pure I3C bus: tCASmax=1 us, 100 us, 2ms, 50ms for respectively ENTAS0,1,2, and 3.
Note: for mixed bus with I2C fm+ device: tBUFmin = 0,5  us.
Note: for mixed bus with I2C fm device: tBUFmin = 1,3  us.
for I3C repeated start timing: it must wait for time to be elapsed after a repeated start (i.e. SDA is de-asserted) and before driving SCL low, refer to. MIPI timing tCASr. This timing is defined by:
 tCASr = [ (FREE[6:0] + 1) x 2 - (0,5 + SDA_HD)] x tI3CCLK
for I3C stop timing: it must wait for time to be elapsed after that the SCL clock is driven high and before the stop condition (i.e. SDA is asserted). This timing is defined by:
tCBP = (FREE[6:0] + 1) x tI3CCLK
for I3C repeated start timing (T-bit when controller ends read with repeated start followed by stop): it must wait for time to be elapsed after that the SCL clock is driven high and before the repeated start condition (i.e. SDA is de-asserted). This timing is defined by:
tCBSr = (FREE[6:0] + 1) x tI3CCLK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA_HD</name>
              <description>SDA hold time (when the I3C is acting as controller), in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull tHD_PP):</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SDA hold time = 0,5 x tI3CCLK </description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SDA hold time = 1,5 x tI3CCLK </description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_TIMINGR2</name>
          <displayName>I3C_TIMINGR2</displayName>
          <description>I3C timing register 2 </description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STALLT</name>
              <description>Controller clock stall on T-bit phase of Data enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase (before 9th bit). This allows the target to prepare data to be sent.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLD</name>
              <description>controller clock stall on PAR phase of Data enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase (before 9th bit). This allows the target to read received data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLC</name>
              <description>controller clock stall on PAR phase of CCC enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase of common command code (before 9th bit). This allows the target to decode the command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLA</name>
              <description>controller clock stall enable on ACK phase
The SCL is stalled (during tSCLL_STALLas defined by STALL)  in the address ACK/NACK phase (before 9th bit). This allows the target to prepare data or the controller to respond to target interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no stall</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>stall enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>controller clock stall time, in number of kernel clock cycles
tSCLL_STALL = STALL x tI3CCLK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_BCR</name>
          <displayName>I3C_BCR</displayName>
          <description>I3C bus characteristics register </description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCR0</name>
              <description>max data speed limitation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>limitation, as described by I3C_GETMXDSR.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCR2</name>
              <description>in-band interrupt (IBI) payload</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no data byte follows the accepted IBI</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>at least one mandatory data byte follows the accepted IBI (and at most 4 data bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCR6</name>
              <description>controller capable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I3C target (no controller capable)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I3C controller capable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_DCR</name>
          <displayName>I3C_DCR</displayName>
          <description>I3C device characteristics register </description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>device characteristics ID
others: ID to describe the type of the I3C sensor/device
Note: The latest MIPI DCR ID assignments are available at: https://www.mipi.org/MIPI_I3C_device_characteristics_register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>generic device (for v1.0 devices)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_GETCAPR</name>
          <displayName>I3C_GETCAPR</displayName>
          <description>I3C get capability register </description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPPEND</name>
              <description>IBI MDB support for pending read notification
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates the support (or not) of the pending read notification via the IBI MDB[7:0] value.
This bit is used to return the GETCAP3 byte in response to the GETCAPS CCC format 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this I3C when acting as target sends an IBI request without a mandatory data byte value indicating a pending read notification</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this I3C when acting as target sends an IBI request with a mandatory data byte value (i.e. a MDB[7:5]=101) indicating a pending read notification</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_CTRLCAPR</name>
          <displayName>I3C_CTRLCAPR</displayName>
          <description>I3C controller capability register </description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPDHOFF</name>
              <description>delayed bus control hand-off
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates if this target I3C may need additional time to process a bus control hand-off requested by the current controller.
This bit is used to return the CTRLCAP2 byte in response to the GETCAPS CCC format 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this I3C does not needs additional time to process a bus control hand-off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this I3C needs additional time to process a bus control hand-off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPGRP</name>
              <description>group management support (when acting as controller)
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates if the I3C is able to support group management when it acts as a controller (after bus control hand-off) via emitted DEFGRPA, RSTGRPA, and SETGRPA CCC.
This bit is used to return the CTRLCAP1 byte in response to the GETCAPS CCC format 2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this I3C does not support group address capabilities</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this I3C supports group address capabilities (when becoming controller)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_GETMXDSR</name>
          <displayName>I3C_GETMXDSR</displayName>
          <description>I3C get capability register </description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOFFAS</name>
              <description>controller hand-off activity state
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates in which initial activity state the (other) current controller should expect the I3C bus after a bus control hand-off to this controller-capable I3C, when returning the defining byte CTRLHDLY (0x91) to a GETMXDS CCC.
This 2-bit field is used to return the CTRLHDLY1 byte in response to the GETCAPS CCC format 3, in order to state which is the activity state of this I3C when becoming controller after a bus control hand-off, and consequently the time the former controller should wait before testing this I3C to be confirmed its ownership.
Question: why registering only controller hand-off activity state and not the bit2=set bus activity state = the activity state before the handing bus control off to this I3C ?</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>activity state 0 is the initial activity state of this I3C before and when becoming controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>activity state 1 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>activity state 2 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>activity state 3 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMT</name>
              <description>GETMXDS CCC format
This field is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates how is returned the GETMXDS format 1 (without MaxRdTurn) and format 2 (with MaxRdTurn).
This bit is used to return the 2-byte format 1 (MaxWr, MaxRd) or 5-byte format 2 (MaxWr, MaxRd, 3-byte MaxRdTurn) byte in response to the GETCAPS CCC.
- 3-byte MaxRdTurn is returned with MSB=0, middle byte=0 and LSB=RDTURN[7:0].
- Max read turnaround time is less than 256  us.
- 3-byte MaxRdTurn is returned with MSB=0, middle byte=RDTURN[7:0] and LSB=0.
- Max read turnaround time is between 256  us and 65535  us
- 3-byte MaxRdTurn is returned with MSB=RDTURN[7:0], middle byte=0 and LSB=0.
- Max read turnaround time is between 65535  us and 16 s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>format 1 (2 bytes with MaxWr with no defining byte, MaxRd)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>format 2: (5 bytes with MaxWr with no defining byte, MaxRd, MaxRdTurn)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>format 2 (5 bytes with MaxWr with no defining byte, MaxRd, and middle byte of MaxRdTurn)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>format 2 (5 bytes with MaxWr with no defining byte, MaxRd, MSB of MaxRdTurn)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDTURN</name>
              <description>programmed byte of the 3-byte MaxRdTurn (maximum read turnaround byte)
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and writes the value of the selected byte (via the FMT[1:0] field) of the 3-byte MaxRdTurn which is returned in response to the GETMXDS CCC format 2 to encode the maximum read turnaround time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_EPIDR</name>
          <displayName>I3C_EPIDR</displayName>
          <description>I3C extended provisioned ID register </description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <resetValue>0x02080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIPIID</name>
              <description>4-bit MIPI Instance ID
This field is written by software to set and identify individually each instance of this I3C IP with a specific number on a single I3C bus.
This field represents the bits[15:12] of the 48-bit provisioned ID.
Note: The bits[11:0] of the provisioned ID may be 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTSEL</name>
              <description>provisioned ID type selector
This field is set as 0 i.e. vendor fixed value.
This field represents the bit[32] of the 48-bit provisioned ID.
Note: The bits[31:16] of the provisioned ID may be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIPIMID</name>
              <description>15-bit MIPI manufacturer ID
This read field is the 15-bit STMicroelectronics MIPI ID i.e. 0x0104.
This field represents the bits[47:33] of the 48-bit provisioned ID.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
