STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 15.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 15.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC16</name>
              <description>Security configuration for peripheral 16
Note: Regardless of SEC value, any execute access to peripheral 16 triggers a bus error.
Note: If the compartment filtering for peripheral 16 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 16.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 16.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC17</name>
              <description>Security configuration for peripheral 17
Note: Regardless of SEC value, any execute access to peripheral 17 triggers a bus error.
Note: If the compartment filtering for peripheral 17 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 17.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 17.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC18</name>
              <description>Security configuration for peripheral 18
Note: Regardless of SEC value, any execute access to peripheral 18 triggers a bus error.
Note: If the compartment filtering for peripheral 18 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 18.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 18.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC19</name>
              <description>Security configuration for peripheral 19
Note: Regardless of SEC value, any execute access to peripheral 19 triggers a bus error.
Note: If the compartment filtering for peripheral 19 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 19.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 19.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC20</name>
              <description>Security configuration for peripheral 20
Note: Regardless of SEC value, any execute access to peripheral 20 triggers a bus error.
Note: If the compartment filtering for peripheral 20 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 20.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 20.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC21</name>
              <description>Security configuration for peripheral 21
Note: Regardless of SEC value, any execute access to peripheral 21 triggers a bus error.
Note: If the compartment filtering for peripheral 21 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 21.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 21.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC22</name>
              <description>Security configuration for peripheral 22
Note: Regardless of SEC value, any execute access to peripheral 22 triggers a bus error.
Note: If the compartment filtering for peripheral 22 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 22.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 22.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC23</name>
              <description>Security configuration for peripheral 23
Note: Regardless of SEC value, any execute access to peripheral 23 triggers a bus error.
Note: If the compartment filtering for peripheral 23 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 23.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC24</name>
              <description>Security configuration for peripheral 24
Note: Regardless of SEC value, any execute access to peripheral 24 triggers a bus error.
Note: If the compartment filtering for peripheral 24 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 24.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 24.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC25</name>
              <description>Security configuration for peripheral 25
Note: Regardless of SEC value, any execute access to peripheral 25 triggers a bus error.
Note: If the compartment filtering for peripheral 25 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 25.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 25.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC26</name>
              <description>Security configuration for peripheral 26
Note: Regardless of SEC value, any execute access to peripheral 26 triggers a bus error.
Note: If the compartment filtering for peripheral 26 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 26.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 26.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC27</name>
              <description>Security configuration for peripheral 27
Note: Regardless of SEC value, any execute access to peripheral 27 triggers a bus error.
Note: If the compartment filtering for peripheral 27 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 27.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 27.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC28</name>
              <description>Security configuration for peripheral 28
Note: Regardless of SEC value, any execute access to peripheral 28 triggers a bus error.
Note: If the compartment filtering for peripheral 28 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 28.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 28.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC29</name>
              <description>Security configuration for peripheral 29
Note: Regardless of SEC value, any execute access to peripheral 29 triggers a bus error.
Note: If the compartment filtering for peripheral 29 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 29.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 29.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC30</name>
              <description>Security configuration for peripheral 30
Note: Regardless of SEC value, any execute access to peripheral 30 triggers a bus error.
Note: If the compartment filtering for peripheral 30 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 30.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 30.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC31</name>
              <description>Security configuration for peripheral 31
Note: Regardless of SEC value, any execute access to peripheral 31 triggers a bus error.
Note: If the compartment filtering for peripheral 31 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 31.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 31.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
