STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <description>Secure and non-secure data access are granted to the peripheral 48.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 48.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC49</name>
              <description>Security configuration for peripheral 49
Note: Regardless of SEC value, any execute access to peripheral 49 triggers a bus error.
Note: If the compartment filtering for peripheral 49 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 49.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 49.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC50</name>
              <description>Security configuration for peripheral 50
Note: Regardless of SEC value, any execute access to peripheral 50 triggers a bus error.
Note: If the compartment filtering for peripheral 50 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 50.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 50.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC51</name>
              <description>Security configuration for peripheral 51
Note: Regardless of SEC value, any execute access to peripheral 51 triggers a bus error.
Note: If the compartment filtering for peripheral 51 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 51.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 51.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC52</name>
              <description>Security configuration for peripheral 52
Note: Regardless of SEC value, any execute access to peripheral 52 triggers a bus error.
Note: If the compartment filtering for peripheral 52 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 52.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 52.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC53</name>
              <description>Security configuration for peripheral 53
Note: Regardless of SEC value, any execute access to peripheral 53 triggers a bus error.
Note: If the compartment filtering for peripheral 53 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 53.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 53.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC54</name>
              <description>Security configuration for peripheral 54
Note: Regardless of SEC value, any execute access to peripheral 54 triggers a bus error.
Note: If the compartment filtering for peripheral 54 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 54.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 54.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC55</name>
              <description>Security configuration for peripheral 55
Note: Regardless of SEC value, any execute access to peripheral 55 triggers a bus error.
Note: If the compartment filtering for peripheral 55 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 55.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 55.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC56</name>
              <description>Security configuration for peripheral 56
Note: Regardless of SEC value, any execute access to peripheral 56 triggers a bus error.
Note: If the compartment filtering for peripheral 56 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 56.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 56.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC57</name>
              <description>Security configuration for peripheral 57
Note: Regardless of SEC value, any execute access to peripheral 57 triggers a bus error.
Note: If the compartment filtering for peripheral 57 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 57.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 57.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC58</name>
              <description>Security configuration for peripheral 58
Note: Regardless of SEC value, any execute access to peripheral 58 triggers a bus error.
Note: If the compartment filtering for peripheral 58 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 58.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 58.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC59</name>
              <description>Security configuration for peripheral 59
Note: Regardless of SEC value, any execute access to peripheral 59 triggers a bus error.
Note: If the compartment filtering for peripheral 59 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 59.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 59.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC60</name>
              <description>Security configuration for peripheral 60
Note: Regardless of SEC value, any execute access to peripheral 60 triggers a bus error.
Note: If the compartment filtering for peripheral 60 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 60.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 60.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC61</name>
              <description>Security configuration for peripheral 61
Note: Regardless of SEC value, any execute access to peripheral 61 triggers a bus error.
Note: If the compartment filtering for peripheral 61 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 61.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 61.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC62</name>
              <description>Security configuration for peripheral 62
Note: Regardless of SEC value, any execute access to peripheral 62 triggers a bus error.
Note: If the compartment filtering for peripheral 62 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 62.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 62.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC63</name>
              <description>Security configuration for peripheral 63
Note: Regardless of SEC value, any execute access to peripheral 63 triggers a bus error.
Note: If the compartment filtering for peripheral 63 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 63.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 63.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
