STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 144.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 144.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC145</name>
              <description>Security configuration for peripheral 145
Note: Regardless of SEC value, any execute access to peripheral 145 triggers a bus error.
Note: If the compartment filtering for peripheral 145 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 145.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 145.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC146</name>
              <description>Security configuration for peripheral 146
Note: Regardless of SEC value, any execute access to peripheral 146 triggers a bus error.
Note: If the compartment filtering for peripheral 146 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 146.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 146.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC147</name>
              <description>Security configuration for peripheral 147
Note: Regardless of SEC value, any execute access to peripheral 147 triggers a bus error.
Note: If the compartment filtering for peripheral 147 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 147.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 147.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC148</name>
              <description>Security configuration for peripheral 148
Note: Regardless of SEC value, any execute access to peripheral 148 triggers a bus error.
Note: If the compartment filtering for peripheral 148 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 148.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 148.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC149</name>
              <description>Security configuration for peripheral 149
Note: Regardless of SEC value, any execute access to peripheral 149 triggers a bus error.
Note: If the compartment filtering for peripheral 149 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 149.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 149.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC150</name>
              <description>Security configuration for peripheral 150
Note: Regardless of SEC value, any execute access to peripheral 150 triggers a bus error.
Note: If the compartment filtering for peripheral 150 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 150.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 150.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC151</name>
              <description>Security configuration for peripheral 151
Note: Regardless of SEC value, any execute access to peripheral 151 triggers a bus error.
Note: If the compartment filtering for peripheral 151 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 151.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 151.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC152</name>
              <description>Security configuration for peripheral 152
Note: Regardless of SEC value, any execute access to peripheral 152 triggers a bus error.
Note: If the compartment filtering for peripheral 152 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 152.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 152.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC153</name>
              <description>Security configuration for peripheral 153
Note: Regardless of SEC value, any execute access to peripheral 153 triggers a bus error.
Note: If the compartment filtering for peripheral 153 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 153.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 153.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC154</name>
              <description>Security configuration for peripheral 154
Note: Regardless of SEC value, any execute access to peripheral 154 triggers a bus error.
Note: If the compartment filtering for peripheral 154 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 154.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 154.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC155</name>
              <description>Security configuration for peripheral 155
Note: Regardless of SEC value, any execute access to peripheral 155 triggers a bus error.
Note: If the compartment filtering for peripheral 155 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 155.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 155.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC156</name>
              <description>Security configuration for peripheral 156
Note: Regardless of SEC value, any execute access to peripheral 156 triggers a bus error.
Note: If the compartment filtering for peripheral 156 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 156.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 156.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC157</name>
              <description>Security configuration for peripheral 157
Note: Regardless of SEC value, any execute access to peripheral 157 triggers a bus error.
Note: If the compartment filtering for peripheral 157 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 157.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 157.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC158</name>
              <description>Security configuration for peripheral 158
Note: Regardless of SEC value, any execute access to peripheral 158 triggers a bus error.
Note: If the compartment filtering for peripheral 158 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 158.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 158.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC159</name>
              <description>Security configuration for peripheral 159
Note: Regardless of SEC value, any execute access to peripheral 159 triggers a bus error.
Note: If the compartment filtering for peripheral 159 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure and non-secure data access are granted to the peripheral 159.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure data access only are granted to the peripheral 159.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
