STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RISC_PRIVCFGR1</name>
          <displayName>RIFSC_RISC_PRIVCFGR1</displayName>
          <description>RIFSC RISFC slave privileged register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV32</name>
              <description>Privileged-only access permission for peripheral 32
Note: If corresponding SEC32 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 32 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 32.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 32.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV33</name>
              <description>Privileged-only access permission for peripheral 33
Note: If corresponding SEC33 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 33 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 33.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 33.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV34</name>
              <description>Privileged-only access permission for peripheral 34
Note: If corresponding SEC34 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 34 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 34.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 34.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV35</name>
              <description>Privileged-only access permission for peripheral 35
Note: If corresponding SEC35 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 35 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 35.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 35.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV36</name>
              <description>Privileged-only access permission for peripheral 36
Note: If corresponding SEC36 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 36 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 36.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 36.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV37</name>
              <description>Privileged-only access permission for peripheral 37
Note: If corresponding SEC37 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 37 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 37.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 37.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV38</name>
              <description>Privileged-only access permission for peripheral 38
Note: If corresponding SEC38 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 38 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 38.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 38.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV39</name>
              <description>Privileged-only access permission for peripheral 39
Note: If corresponding SEC39 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 39 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 39.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 39.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV40</name>
              <description>Privileged-only access permission for peripheral 40
Note: If corresponding SEC40 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 40 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 40.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 40.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV41</name>
              <description>Privileged-only access permission for peripheral 41
Note: If corresponding SEC41 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 41 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 41.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 41.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV42</name>
              <description>Privileged-only access permission for peripheral 42
Note: If corresponding SEC42 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 42 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 42.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 42.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV43</name>
              <description>Privileged-only access permission for peripheral 43
Note: If corresponding SEC43 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 43 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 43.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 43.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV44</name>
              <description>Privileged-only access permission for peripheral 44
Note: If corresponding SEC44 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 44 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 44.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 44.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV45</name>
              <description>Privileged-only access permission for peripheral 45
Note: If corresponding SEC45 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 45 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 45.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV46</name>
              <description>Privileged-only access permission for peripheral 46
Note: If corresponding SEC46 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 46 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 46.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 46.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV47</name>
              <description>Privileged-only access permission for peripheral 47
Note: If corresponding SEC47 bit is set in RIFSC_RISC_SECCFGRx, this bit can only be written by a secure privileged application.
Note: If the compartment filtering for peripheral 47 is enabled (resp. disabled) using CFEN in RIFSC_RISC_PERy_CIDCFGR, only an authorized compartment (resp. any compartment) can write this bit, if privilege and security of the access is sufficient.
Note: Authorized compartment is defined as SCID if SEM_EN=0 in RIFSC_RISC_PERy_CIDCFGR. If SEM_EN=1, it is equal to SEMCID, if SEM_MUTEX=1 in RIFSC_RISC_PERy_SEMCR. There is no authorized compartment if SEM_EN=1 and SEM_MUTEX=0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged data access are granted to the peripheral 47.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Privileged data access only are granted to the peripheral 47.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
