STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RISC_RCFGLOCKR0</name>
          <displayName>RIFSC_RISC_RCFGLOCKR0</displayName>
          <description>RIFSC RISC slave resource configuration lock register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RLOCK0</name>
              <description>rRsource lock for peripheral 0
This bit is set to lock the peripheral resource 0. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC0 in RIFSC_RISC_SECCFGRx and PRIV0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC0 and PRIV0 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK1</name>
              <description>rRsource lock for peripheral 1
This bit is set to lock the peripheral resource 1. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC1 in RIFSC_RISC_SECCFGRx and PRIV1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC1 and PRIV1 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK2</name>
              <description>rRsource lock for peripheral 2
This bit is set to lock the peripheral resource 2. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC2 in RIFSC_RISC_SECCFGRx and PRIV2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC2 and PRIV2 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK3</name>
              <description>rRsource lock for peripheral 3
This bit is set to lock the peripheral resource 3. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC3 in RIFSC_RISC_SECCFGRx and PRIV3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC3 and PRIV3 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK4</name>
              <description>rRsource lock for peripheral 4
This bit is set to lock the peripheral resource 4. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC4 in RIFSC_RISC_SECCFGRx and PRIV4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC4 and PRIV4 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK5</name>
              <description>rRsource lock for peripheral 5
This bit is set to lock the peripheral resource 5. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC5 in RIFSC_RISC_SECCFGRx and PRIV5</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC5 and PRIV5 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK6</name>
              <description>rRsource lock for peripheral 6
This bit is set to lock the peripheral resource 6. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC6 in RIFSC_RISC_SECCFGRx and PRIV6</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC6 and PRIV6 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK7</name>
              <description>rRsource lock for peripheral 7
This bit is set to lock the peripheral resource 7. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC7 in RIFSC_RISC_SECCFGRx and PRIV7</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC7 and PRIV7 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK8</name>
              <description>rRsource lock for peripheral 8
This bit is set to lock the peripheral resource 8. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC8 in RIFSC_RISC_SECCFGRx and PRIV8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC8 and PRIV8 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK9</name>
              <description>rRsource lock for peripheral 9
This bit is set to lock the peripheral resource 9. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC9 in RIFSC_RISC_SECCFGRx and PRIV9</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC9 and PRIV9 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK10</name>
              <description>rRsource lock for peripheral 10
This bit is set to lock the peripheral resource 10. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC10 in RIFSC_RISC_SECCFGRx and PRIV10</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC10 and PRIV10 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK11</name>
              <description>rRsource lock for peripheral 11
This bit is set to lock the peripheral resource 11. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC11 in RIFSC_RISC_SECCFGRx and PRIV11</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC11 and PRIV11 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK12</name>
              <description>rRsource lock for peripheral 12
This bit is set to lock the peripheral resource 12. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC12 in RIFSC_RISC_SECCFGRx and PRIV12</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC12 and PRIV12 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK13</name>
              <description>rRsource lock for peripheral 13
This bit is set to lock the peripheral resource 13. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC13 in RIFSC_RISC_SECCFGRx and PRIV13</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC13 and PRIV13 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK14</name>
              <description>rRsource lock for peripheral 14
This bit is set to lock the peripheral resource 14. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC14 in RIFSC_RISC_SECCFGRx and PRIV14</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC14 and PRIV14 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK15</name>
              <description>rRsource lock for peripheral 15
This bit is set to lock the peripheral resource 15. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC15 in RIFSC_RISC_SECCFGRx and PRIV15</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC15 and PRIV15 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK16</name>
              <description>rRsource lock for peripheral 16
This bit is set to lock the peripheral resource 16. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC16 in RIFSC_RISC_SECCFGRx and PRIV16</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC16 and PRIV16 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK17</name>
              <description>rRsource lock for peripheral 17
This bit is set to lock the peripheral resource 17. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC17 in RIFSC_RISC_SECCFGRx and PRIV17</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC17 and PRIV17 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK18</name>
              <description>rRsource lock for peripheral 18
This bit is set to lock the peripheral resource 18. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC18 in RIFSC_RISC_SECCFGRx and PRIV18</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC18 and PRIV18 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK19</name>
              <description>rRsource lock for peripheral 19
This bit is set to lock the peripheral resource 19. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC19 in RIFSC_RISC_SECCFGRx and PRIV19</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC19 and PRIV19 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK20</name>
              <description>rRsource lock for peripheral 20
This bit is set to lock the peripheral resource 20. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC20 in RIFSC_RISC_SECCFGRx and PRIV20</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC20 and PRIV20 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK21</name>
              <description>rRsource lock for peripheral 21
This bit is set to lock the peripheral resource 21. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC21 in RIFSC_RISC_SECCFGRx and PRIV21</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
