STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <name>B_0x1</name>
                  <description>Writes to SEC53 and PRIV53 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK54</name>
              <description>rRsource lock for peripheral 54
This bit is set to lock the peripheral resource 54. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC54 in RIFSC_RISC_SECCFGRx and PRIV54</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC54 and PRIV54 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK55</name>
              <description>rRsource lock for peripheral 55
This bit is set to lock the peripheral resource 55. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC55 in RIFSC_RISC_SECCFGRx and PRIV55</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC55 and PRIV55 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK56</name>
              <description>rRsource lock for peripheral 56
This bit is set to lock the peripheral resource 56. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC56 in RIFSC_RISC_SECCFGRx and PRIV56</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC56 and PRIV56 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK57</name>
              <description>rRsource lock for peripheral 57
This bit is set to lock the peripheral resource 57. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC57 in RIFSC_RISC_SECCFGRx and PRIV57</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC57 and PRIV57 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK58</name>
              <description>rRsource lock for peripheral 58
This bit is set to lock the peripheral resource 58. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC58 in RIFSC_RISC_SECCFGRx and PRIV58</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC58 and PRIV58 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK59</name>
              <description>rRsource lock for peripheral 59
This bit is set to lock the peripheral resource 59. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC59 in RIFSC_RISC_SECCFGRx and PRIV59</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC59 and PRIV59 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK60</name>
              <description>rRsource lock for peripheral 60
This bit is set to lock the peripheral resource 60. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC60 in RIFSC_RISC_SECCFGRx and PRIV60</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC60 and PRIV60 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK61</name>
              <description>rRsource lock for peripheral 61
This bit is set to lock the peripheral resource 61. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC61 in RIFSC_RISC_SECCFGRx and PRIV61</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC61 and PRIV61 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK62</name>
              <description>rRsource lock for peripheral 62
This bit is set to lock the peripheral resource 62. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC62 in RIFSC_RISC_SECCFGRx and PRIV62</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC62 and PRIV62 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK63</name>
              <description>rRsource lock for peripheral 63
This bit is set to lock the peripheral resource 63. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC63 in RIFSC_RISC_SECCFGRx and PRIV63</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC63 and PRIV63 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
