STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <name>B_0x1</name>
                  <description>Writes to SEC85 and PRIV85 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK86</name>
              <description>rRsource lock for peripheral 86
This bit is set to lock the peripheral resource 86. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC86 in RIFSC_RISC_SECCFGRx and PRIV86</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC86 and PRIV86 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK87</name>
              <description>rRsource lock for peripheral 87
This bit is set to lock the peripheral resource 87. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC87 in RIFSC_RISC_SECCFGRx and PRIV87</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC87 and PRIV87 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK88</name>
              <description>rRsource lock for peripheral 88
This bit is set to lock the peripheral resource 88. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC88 in RIFSC_RISC_SECCFGRx and PRIV88</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC88 and PRIV88 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK89</name>
              <description>rRsource lock for peripheral 89
This bit is set to lock the peripheral resource 89. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC89 in RIFSC_RISC_SECCFGRx and PRIV89</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC89 and PRIV89 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK90</name>
              <description>rRsource lock for peripheral 90
This bit is set to lock the peripheral resource 90. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC90 in RIFSC_RISC_SECCFGRx and PRIV90</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC90 and PRIV90 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK91</name>
              <description>rRsource lock for peripheral 91
This bit is set to lock the peripheral resource 91. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC91 in RIFSC_RISC_SECCFGRx and PRIV91</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC91 and PRIV91 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK92</name>
              <description>rRsource lock for peripheral 92
This bit is set to lock the peripheral resource 92. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC92 in RIFSC_RISC_SECCFGRx and PRIV92</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC92 and PRIV92 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK93</name>
              <description>rRsource lock for peripheral 93
This bit is set to lock the peripheral resource 93. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC93 in RIFSC_RISC_SECCFGRx and PRIV93</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC93 and PRIV93 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK94</name>
              <description>rRsource lock for peripheral 94
This bit is set to lock the peripheral resource 94. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC94 in RIFSC_RISC_SECCFGRx and PRIV94</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC94 and PRIV94 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK95</name>
              <description>rRsource lock for peripheral 95
This bit is set to lock the peripheral resource 95. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC95 in RIFSC_RISC_SECCFGRx and PRIV95</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC95 and PRIV95 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
