STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <description>SEC149 in RIFSC_RISC_SECCFGRx and PRIV149</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC149 and PRIV149 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK150</name>
              <description>rRsource lock for peripheral 150
This bit is set to lock the peripheral resource 150. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC150 in RIFSC_RISC_SECCFGRx and PRIV150</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC150 and PRIV150 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK151</name>
              <description>rRsource lock for peripheral 151
This bit is set to lock the peripheral resource 151. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC151 in RIFSC_RISC_SECCFGRx and PRIV151</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC151 and PRIV151 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK152</name>
              <description>rRsource lock for peripheral 152
This bit is set to lock the peripheral resource 152. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC152 in RIFSC_RISC_SECCFGRx and PRIV152</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC152 and PRIV152 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK153</name>
              <description>rRsource lock for peripheral 153
This bit is set to lock the peripheral resource 153. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC153 in RIFSC_RISC_SECCFGRx and PRIV153</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC153 and PRIV153 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK154</name>
              <description>rRsource lock for peripheral 154
This bit is set to lock the peripheral resource 154. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC154 in RIFSC_RISC_SECCFGRx and PRIV154</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC154 and PRIV154 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK155</name>
              <description>rRsource lock for peripheral 155
This bit is set to lock the peripheral resource 155. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC155 in RIFSC_RISC_SECCFGRx and PRIV155</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC155 and PRIV155 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK156</name>
              <description>rRsource lock for peripheral 156
This bit is set to lock the peripheral resource 156. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC156 in RIFSC_RISC_SECCFGRx and PRIV156</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC156 and PRIV156 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK157</name>
              <description>rRsource lock for peripheral 157
This bit is set to lock the peripheral resource 157. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC157 in RIFSC_RISC_SECCFGRx and PRIV157</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC157 and PRIV157 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK158</name>
              <description>rRsource lock for peripheral 158
This bit is set to lock the peripheral resource 158. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC158 in RIFSC_RISC_SECCFGRx and PRIV158</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC158 and PRIV158 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK159</name>
              <description>rRsource lock for peripheral 159
This bit is set to lock the peripheral resource 159. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC159 in RIFSC_RISC_SECCFGRx and PRIV159</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC159 and PRIV159 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
