STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RISC_RCFGLOCKR5</name>
          <displayName>RIFSC_RISC_RCFGLOCKR5</displayName>
          <description>RIFSC RISC slave resource configuration lock register 5</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RLOCK160</name>
              <description>rRsource lock for peripheral 160
This bit is set to lock the peripheral resource 160. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC160 in RIFSC_RISC_SECCFGRx and PRIV160</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC160 and PRIV160 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK161</name>
              <description>rRsource lock for peripheral 161
This bit is set to lock the peripheral resource 161. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC161 in RIFSC_RISC_SECCFGRx and PRIV161</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC161 and PRIV161 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK162</name>
              <description>rRsource lock for peripheral 162
This bit is set to lock the peripheral resource 162. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC162 in RIFSC_RISC_SECCFGRx and PRIV162</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC162 and PRIV162 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK163</name>
              <description>rRsource lock for peripheral 163
This bit is set to lock the peripheral resource 163. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC163 in RIFSC_RISC_SECCFGRx and PRIV163</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC163 and PRIV163 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK164</name>
              <description>rRsource lock for peripheral 164
This bit is set to lock the peripheral resource 164. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC164 in RIFSC_RISC_SECCFGRx and PRIV164</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC164 and PRIV164 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK165</name>
              <description>rRsource lock for peripheral 165
This bit is set to lock the peripheral resource 165. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC165 in RIFSC_RISC_SECCFGRx and PRIV165</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC165 and PRIV165 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK166</name>
              <description>rRsource lock for peripheral 166
This bit is set to lock the peripheral resource 166. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC166 in RIFSC_RISC_SECCFGRx and PRIV166</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC166 and PRIV166 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK167</name>
              <description>rRsource lock for peripheral 167
This bit is set to lock the peripheral resource 167. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC167 in RIFSC_RISC_SECCFGRx and PRIV167</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC167 and PRIV167 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK168</name>
              <description>rRsource lock for peripheral 168
This bit is set to lock the peripheral resource 168. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC168 in RIFSC_RISC_SECCFGRx and PRIV168</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC168 and PRIV168 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK169</name>
              <description>rRsource lock for peripheral 169
This bit is set to lock the peripheral resource 169. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC169 in RIFSC_RISC_SECCFGRx and PRIV169</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC169 and PRIV169 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK170</name>
              <description>rRsource lock for peripheral 170
This bit is set to lock the peripheral resource 170. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC170 in RIFSC_RISC_SECCFGRx and PRIV170</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC170 and PRIV170 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK171</name>
              <description>rRsource lock for peripheral 171
This bit is set to lock the peripheral resource 171. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC171 in RIFSC_RISC_SECCFGRx and PRIV171</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC171 and PRIV171 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK172</name>
              <description>rRsource lock for peripheral 172
This bit is set to lock the peripheral resource 172. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC172 in RIFSC_RISC_SECCFGRx and PRIV172</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC172 and PRIV172 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK173</name>
              <description>rRsource lock for peripheral 173
This bit is set to lock the peripheral resource 173. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC173 in RIFSC_RISC_SECCFGRx and PRIV173</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC173 and PRIV173 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK174</name>
              <description>rRsource lock for peripheral 174
This bit is set to lock the peripheral resource 174. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC174 in RIFSC_RISC_SECCFGRx and PRIV174</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC174 and PRIV174 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK175</name>
              <description>rRsource lock for peripheral 175
This bit is set to lock the peripheral resource 175. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC175 in RIFSC_RISC_SECCFGRx and PRIV175</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC175 and PRIV175 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK176</name>
              <description>rRsource lock for peripheral 176
This bit is set to lock the peripheral resource 176. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC176 in RIFSC_RISC_SECCFGRx and PRIV176</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC176 and PRIV176 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK177</name>
              <description>rRsource lock for peripheral 177
This bit is set to lock the peripheral resource 177. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC177 in RIFSC_RISC_SECCFGRx and PRIV177</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC177 and PRIV177 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK178</name>
              <description>rRsource lock for peripheral 178
This bit is set to lock the peripheral resource 178. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC178 in RIFSC_RISC_SECCFGRx and PRIV178</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC178 and PRIV178 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK179</name>
              <description>rRsource lock for peripheral 179
This bit is set to lock the peripheral resource 179. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC179 in RIFSC_RISC_SECCFGRx and PRIV179</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC179 and PRIV179 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK180</name>
              <description>rRsource lock for peripheral 180
This bit is set to lock the peripheral resource 180. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SEC180 in RIFSC_RISC_SECCFGRx and PRIV180</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to SEC180 and PRIV180 are ignored. Writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK181</name>
              <description>rRsource lock for peripheral 181
This bit is set to lock the peripheral resource 181. It is cleared by default and, once set, this bit cannot be cleared until the RIFSC RISC peripheral is reset.
in RIFSC_RISC_PRIVCFGRx are writable. RIFSC_RISC_PERy_CIDCFGR is writable.
to RIFSC_RISC_PERy_CIDCFGR register are ignored.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
