STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RISC_PER99_CIDCFGR</name>
          <displayName>RIFSC_RISC_PER99_CIDCFGR</displayName>
          <description>RIFSC RISC slave peripheral 99 CID configuration register</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEN</name>
              <description>CID filtering enable
For any CFEN value, access controls to peripheral y defined in RIFSC_RISC_PRIVCFGRx and RIFSC_RISC_SECCFGRx always apply. 
Note: When this bit is cleared from 1 by the trusted domain application, SEM_MUTEX is cleared to zero by RISC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment-based filtering defined in RIFSC_RISC_PERy_CIDCFGR and optionally RIFSC_RISC_PERy_SEMCR is disabled for peripheral y.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment-based filtering defined in RIFSC_RISC_PERy_CIDCFGR and optionally RIFSC_RISC_PERy_SEMCR is enabled for peripheral y.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEM_EN</name>
              <description>Semaphore enable
to SEMCID in RIFSC_RISC_PERy_SEMCR.
Note: This bit is not taken into account by RISC if the compartment filtering is off (CFEN = 0). When this bit is cleared from 1 by the trusted domain application, SEM_MUTEX is cleared to zero by RISC.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Access to peripheral y is granted only if CID of the access equals to SCID.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Access to peripheral y is granted only if SEM_MUTEX = 1 and CID of the access equals</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCID</name>
              <description>Static CID
The trusted domain application uses this bit field to statically define which compartment has access to the peripheral y when SEM_EN = 0.
This CID is not taken into account by RISC when the semaphore is enabled 
Note: (SEM_EN = 1) or compartment filtering is off (CFEN = 0).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEMWLC0</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC1</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC2</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC3</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC4</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC5</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC6</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMWLC7</name>
              <description>Semaphore white list for compartment i
Note: This bit is not taken into account by RISC when the semaphore is disabled (SEM_EN=0) or compartment filtering is off (CFEN=0).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Application running in compartment i cannot get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Application running in compartment i can get access to peripheral y through the semaphore SEM_MUTEX.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RISC_PER99_SEMCR</name>
          <displayName>RIFSC_RISC_PER99_SEMCR</displayName>
          <description>RIFSC RISC slave peripheral 99 semaphore control register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEM_MUTEX</name>
              <description>Semaphore mutex
A white-listed application can set this bit to get exclusive access to peripheral y when SEM_EN is set in RIFSC_RISC_PERy_CIDCFGR (writes are ignored otherwise).
Read 0: Semaphore is free to take.
Read 1: Semaphore is taken.
Write 0: Release semaphore.
Write 1: Acquire semaphore.
Note: When SEM_MUTEX = 0, only applications belonging to white-listed compartments (defined with SEMWLCi bits in RIFSC_RISC_PERy_CIDCFGR) can acquire this semaphore.
Note: When SEM_MUTEX = 1, only applications belonging to compartment SEMCID can release this semaphore.
Note: This bit is cleared when CFEN or SEM_EN are cleared from 1 by the trusted domain application in RIFSC_RISC_PERy_CIDCFGR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEMCID</name>
              <description>Semaphore current CID
When SEM_EN and CFEN are set in RIFSC_RISC_PERy_CIDCFGR, this read-only bit field is updated with the CID value of the latest successful acquisition of RIFSC_RISC_PERy_SEMCR semaphore (SEM_MUTEX = 1). 
In all the other cases, this bit field stays unchanged.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
