STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RISC_REG2_ACFGR</name>
          <displayName>RIFSC_RISC_REG2_ACFGR</displayName>
          <description>RIFSC RISAL memory region 2 subregion z configuration register</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Subregion enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Subregion z is disabled. Only secure, privileged, and trusted domain CID can access between this subregion start and end addresses.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Subregion z of region x is enabled. Access control defined in this subregion applies to any access between this subregion start and end addresses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK</name>
              <description>Resource lock
This bit is set to lock this subregion resource. This bit is set once, cleared 
only by RIFSC reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCID</name>
              <description>Subregion CID
When SREN = 1, this bit field defines which compartment has access to the subregion z 
of region x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by PRIV and SRCID[2:0] also apply.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Only non-secure requests can access subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only secure requests can access subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by SEC and SRCID[2:0] also apply.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged accesses are granted in subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged accesses are granted in subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RISC_REG2_BCFGR</name>
          <displayName>RIFSC_RISC_REG2_BCFGR</displayName>
          <description>RIFSC RISAL memory region 2 subregion z configuration register</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000031</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Subregion enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Subregion z is disabled. Only secure, privileged, and trusted domain CID can access between this subregion start and end addresses.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Subregion z of region x is enabled. Access control defined in this subregion applies to any access between this subregion start and end addresses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK</name>
              <description>Resource lock
This bit is set to lock this subregion resource. This bit is set once, cleared 
only by RIFSC reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCID</name>
              <description>Subregion CID
When SREN = 1, this bit field defines which compartment has access to the subregion z 
of region x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by PRIV and SRCID[2:0] also apply.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Only non-secure requests can access subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only secure requests can access subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by SEC and SRCID[2:0] also apply.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged accesses are granted in subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged accesses are granted in subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RISC_REG3_ACFGR</name>
          <displayName>RIFSC_RISC_REG3_ACFGR</displayName>
          <description>RIFSC RISAL memory region 3 subregion z configuration register</description>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Subregion enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Subregion z is disabled. Only secure, privileged, and trusted domain CID can access between this subregion start and end addresses.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Subregion z of region x is enabled. Access control defined in this subregion applies to any access between this subregion start and end addresses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK</name>
              <description>Resource lock
This bit is set to lock this subregion resource. This bit is set once, cleared 
only by RIFSC reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCID</name>
              <description>Subregion CID
When SREN = 1, this bit field defines which compartment has access to the subregion z 
of region x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by PRIV and SRCID[2:0] also apply.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Only non-secure requests can access subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only secure requests can access subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by SEC and SRCID[2:0] also apply.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged accesses are granted in subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged accesses are granted in subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RISC_REG3_BCFGR</name>
          <displayName>RIFSC_RISC_REG3_BCFGR</displayName>
          <description>RIFSC RISAL memory region 3 subregion z configuration register</description>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000031</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Subregion enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Subregion z is disabled. Only secure, privileged, and trusted domain CID can access between this subregion start and end addresses.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Subregion z of region x is enabled. Access control defined in this subregion applies to any access between this subregion start and end addresses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLOCK</name>
              <description>Resource lock
This bit is set to lock this subregion resource. This bit is set once, cleared 
only by RIFSC reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to RIFSC_RISC_REGx_zCFGR and RIFSC_RISC_REGx_zADDR are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCID</name>
              <description>Subregion CID
When SREN = 1, this bit field defines which compartment has access to the subregion z 
of region x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by PRIV and SRCID[2:0] also apply.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Only non-secure requests can access subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only secure requests can access subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged subregion
This bit is taken into account only if SREN = 1.
Note: Access control defined by SEC and SRCID[2:0] also apply.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged accesses are granted in subregion z of region x.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged accesses are granted in subregion z of region x.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_CR</name>
          <displayName>RIFSC_RIMC_CR</displayName>
          <description>RIFSC RIMC master configuration register</description>
          <addressOffset>0xC00</addressOffset>
          <size>0x20</size>
          <access>read-writeOnce</access>
          <resetValue>0x00008710</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GLOCK</name>
              <description>Global lock
This bit is used to lock the configuration of RIFSC RIMC registers until next reset. This bit is cleared by default and, once set, it cannot be reset until global RIFSC reset.
Note: Secure privileged write access only. Write only by debug domain and trusted domain CIDs, as defined in this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RIFSC RIMC registers are writable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>All writes to RIFSC RIMC registers are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUCDONE</name>
              <description>Wake-up CPU done
Setting this bit deactivates the wake-up CPU mechanism described in Section5.2: Resource isolation framework (RIF). Reading this bit always returns zero.
Note: Secure privileged write access only. Write only by debug domain and trusted domain CIDs, as defined in this register (including this bit).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>When WUCEN = 1 in RIFSC_RIMC_SR, the trusted domain CID information is fixed to0x2 (wake-up CPU), else it is defined in this register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Setting this bit clears WUCEN after few cycles. Once WUCEN =0, the trusted domain CID information is defined in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCID</name>
              <description>Trusted domain compartment ID
Master with this compartment ID runs the application with the highest level of trust. TDCID[2:0] value is distributed in all the device. This bit field is write once (subsequent writes are ignored).
Note: Secure privileged write access only. Write only by debug domain and trusted domain CIDs, as defined in this register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>DAPCID</name>
              <description>Debug access port compartment ID
This bit field defines the CID of the DAP when GDPEN is set in RIFSC_RIMC_SR. 
When DAPCID[2:0] = 0x7, debugging tools have the highest level of debug access, if secure global debug profile is enabled in the BSEC peripheral.
When GDPEN = 0, DAPCID[2:0] can be written by trusted application (TDCID secure privileged). When GDPEN = 1, the DAP can also change this bit field regardless of the access type (secure, non-secure, privileged, or unprivileged).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDEN</name>
              <description>Debug domain enable
This read-only bit gives the status on the debug domain feature availability on this device.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Debug domain not available</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Debug domain available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
