STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RIMC_SR</name>
          <displayName>RIFSC_RIMC_SR</displayName>
          <description>RIFSC RIMC master status register</description>
          <addressOffset>0xC04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDPEN</name>
              <description>Global debug profile enable
This read-only bit is set when the global-debug profile is activated in the device (CPU and MCU debugging allowed).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Global-debug profile (CPU + MCU) is not activated.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Global-debug profile (CPU + MCU) is activated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUCEN</name>
              <description>Wake-up CPU enable
This read-only bit is set when the application properly initializes the wake-up CPU mechanism described in Section5.2: Resource isolation framework (RIF).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up CPU is disabled. The trusted domain CID value is driven by RIFSC_RIMC_CR.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up CPU is enabled. The trusted domain CID value is fixed to 0x2 until the application sets WUCDONE in RIFSC_RIMC_CR (in this case, WUCDONE is cleared after few cycles).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR0</name>
          <displayName>RIFSC_RIMC_ATTR0</displayName>
          <description>RIFSC RIMC master attribute register 0</description>
          <addressOffset>0xC10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR1</name>
          <displayName>RIFSC_RIMC_ATTR1</displayName>
          <description>RIFSC RIMC master attribute register 1</description>
          <addressOffset>0xC14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR2</name>
          <displayName>RIFSC_RIMC_ATTR2</displayName>
          <description>RIFSC RIMC master attribute register 2</description>
          <addressOffset>0xC18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR3</name>
          <displayName>RIFSC_RIMC_ATTR3</displayName>
          <description>RIFSC RIMC master attribute register 3</description>
          <addressOffset>0xC1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR4</name>
          <displayName>RIFSC_RIMC_ATTR4</displayName>
          <description>RIFSC RIMC master attribute register 4</description>
          <addressOffset>0xC20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
