STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
        <register>
          <name>RIFSC_RIMC_ATTR5</name>
          <displayName>RIFSC_RIMC_ATTR5</displayName>
          <description>RIFSC RIMC master attribute register 5</description>
          <addressOffset>0xC24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR6</name>
          <displayName>RIFSC_RIMC_ATTR6</displayName>
          <description>RIFSC RIMC master attribute register 6</description>
          <addressOffset>0xC28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR7</name>
          <displayName>RIFSC_RIMC_ATTR7</displayName>
          <description>RIFSC RIMC master attribute register 7</description>
          <addressOffset>0xC2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR8</name>
          <displayName>RIFSC_RIMC_ATTR8</displayName>
          <description>RIFSC RIMC master attribute register 8</description>
          <addressOffset>0xC30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR9</name>
          <displayName>RIFSC_RIMC_ATTR9</displayName>
          <description>RIFSC RIMC master attribute register 9</description>
          <addressOffset>0xC34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIFSC_RIMC_ATTR10</name>
          <displayName>RIFSC_RIMC_ATTR10</displayName>
          <description>RIFSC RIMC master attribute register 10</description>
          <addressOffset>0xC38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CIDSEL</name>
              <description>CID selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Compartment ID of master x is driven by hardware value or by inheritance to associated RISUP. See master table in Section8.3 for details.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Compartment ID of master x is defined by MCID[2:0] in this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCID</name>
              <description>Master CID
Value of the CID flag on the interconnect for this master, programmed by the trusted domain.
Valid only if indicated in RIF masters table in Section8.3. This bit field is not taken into account when CIDSEL = 0 in this register.
This bit field cannot be written with a value of 0x7 (write to MCID[2:0] is ignored).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure
Value of the secure flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is non-secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged
Value of the privileged flag on the interconnect for this master, programmed by the trusted domain.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>This master is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>This master is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
