STMicroelectronics/meta-st-stm32mp/recipes-devtools/cmsis-svd/cmsis-svd/STM32MP25_CM0P.svd
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN52</name>
              <description>Peripheral protection enable 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 52 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 52 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN53</name>
              <description>Peripheral protection enable 53</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 53 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 53 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN54</name>
              <description>Peripheral protection enable 54</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 54 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 54 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN55</name>
              <description>Peripheral protection enable 55</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 55 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 55 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN56</name>
              <description>Peripheral protection enable 56</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 56 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 56 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN57</name>
              <description>Peripheral protection enable 57</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 57 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 57 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN58</name>
              <description>Peripheral protection enable 58</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 58 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 58 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN59</name>
              <description>Peripheral protection enable 59</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 59 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 59 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN60</name>
              <description>Peripheral protection enable 60</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 60 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 60 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN61</name>
              <description>Peripheral protection enable 61</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 61 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 61 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN62</name>
              <description>Peripheral protection enable 62</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 62 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 62 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPEN63</name>
              <description>Peripheral protection enable 63</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RISUP protection to peripheral 63 is not present. The corresponding RIFSC_RISC_PERy_CIDCFGR and RIFSC_RISC_PERy_SEMCR (where y = i + 32 * x) are reserved.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RISUP protection to peripheral 63 is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
